###########################################################################################
# Словарь чисел
# 30/09/2015
###########################################################################################
\—|\–=-
(\x20){2,}=$1
@(\x26)\s?([IVXMDLC]+)=$2
@([IVXMDLC]+)\s?(\x26)=$1
@([A-Z])\.([A-Z])\.?=$1_$2_
\b(\d+)([а-яё]{1,4}\.?)\b=$1 $2
@((\bв\b|\bг\b)\.\s?){2}=$2$2. 
@([IVXMDLC]+)\s?((\bв\.){2}|(\bв\\\bв)|(\bв\/\bв)|(\bв\.\bв\.))([^\.])=$1 вв. $7
@\b([г]{2}|(\bг\.){2}|(\bг\\\bг)|(\bг\/\bг))\b\.?=гг.
@(\d+)\s?(\bг\b|\bгг\b)\.?=$1 $2.
@([IVXMDLC]+)\s?(\bвв\b)([^\.])=$1 $2. $3
@(\bкон\.)\s([IVXMDLC]+)=конец $2
@(\d+)\s?(\bX\b)\s?(\d+)=$1x$3
(\-)(\bти|\bи)(летней\b)=$1$3
# коррекция 21.45 - 21:45 (если нужно)
\b([0-2][0-9])\.([0-5][0-9])\b=$1:$2$3
(\d+)\.(\d+)=$1,$2
# коррекция отделения разрядов в больших числах
([\s\`\'])([0]{3})\b=$2
([^\:\d])(\d+)(\s|\`|\')([0]{3})=$1$2$4
(\d{1,3})[0]{9}([^\d])=$1 млрд.$2
(\d{1,3})[0]{6}([^\d])=$1 млн.$2
(\d{2,3})[0]{3}([^\d])=$1 тыс.$2
@(\°)([\s]+)?(\bC\b|\bС\b)=$1 цельсия
@(\°)([\s]+)?(\bК\b|\bK\b)=$1 кельвина
###########################################################################################
#Римские цифры
###########################################################################################
# Исключения
@\bCD\b=cd
S.T.A.L.K.E.R.=Сталкер
(\bV\.\bI\.\bP\.|\bVIP\b)=ви'ай'пи
(\bC)V(IX\b)=$1$2
((\bг\b|\bгр\b|\bд\b|\bм\b)\-([а-яё]+)|\bдокт\.)\s\b([IVXMDLC]+)\b=$1 _$4
#
@\b(M{0,4})(CM|CD|D?C{0,3})(XC|XL|L?X{0,3})(IX|IV|V?I{0,3})\b=<$1+><+$2+><+$3+><+$4>
#
<\+?\bMMM\b\+><\+\+>(<\+\b[MVIDCLX]+\+>)=30$1
<\+?\bMMM\b\+><\+\+><\+\+>(<\+\b[VICLX]+>)=300$1
<\+?\bMMM\b\+>(<\+\b[VICDMLX]+\+>)=3$1
<\bMMM\b\+>=3000
<\+?\bMM\b\+><\+\+>(<\+\b[MVIDCLX]+\+>)=20$1
<\+?\bMM\b\+><\+\+><\+\+>(<\+\b[VICLX]+>)=200$1
<\+?\bMM\b\+>(<\+\b[VICDMLX]+\+>)=2$1
<\bMM\b\+>=2000
<\+?\bM\b\+><\+\+>(<\+\b[MVIDCLX]+\+>)=10$1
<\+?\bM\b\+><\+\+><\+\+>(<\+\b[VICLX]+>)=100$1
<\+?\bM\b\+>(<\+\b[VICDMLX]+\+>)=1$1
<\+?\bM\b\+>=1000
#
<\+\bDCCC\b\+><\+\+>(<\+\b[VICLX]+>)=80$1
<\+\bDCCC\b\+>(<\+\b[VICLX]+\+>)=8$1
<\+\bDCCC\b\+>=800
<\+\bDCCC\b>=800<рим.ч.>
<\+\bDCC\b\+><\+\+>(<\+\b[VICLX]+>)=70$1
<\+\bDCC\b\+>(<\+\b[VICLX]+\+>)=7$1
<\+\bDCC\b\+>=700
<\+\bDCC\b>=700<рим.ч.>
<\+\bCCC\b\+><\+\+>(<\+\b[VICLX]+>)=30$1
<\+\bCCC\b\+>(<\+\b[VICLX]+\+>)=3$1
<\+\bCCC\b\+>=300
<\+\bCCC\b>=300<рим.ч.>
<\+\bDC\b\+><\+\+>(<\+\b[VICLX]+>)=60$1
<\+\bDC\b\+>(<\+\b[VICLX]+\+>)=6$1
<\+\bDC\b\+>=600
<\+\bDC\b>=600<рим.ч.>
<\+\bCD\b\+><\+\+>(<\+\b[VICLX]+>)=40$1
<\+\bCD\b\+>(<\+\b[VICLX]+\+>)=4$1
<\+\bCD\b\+>=400
<\+\bCD\b>=400<рим.ч.>
<\+\bCM\b\+><\+\+>(<\+\b[VICLX]+>)=90$1
<\+\bCM\b\+>(<\+\b[VICLX]+\+>)=9$1
<\+\bCM\b\+>=900
<\+\bCM\b>=900<рим.ч.>
<\+\bCC\b\+><\+\+>(<\+\b[VICLX]+>)=20$1
<\+\bCC\b\+>(<\+\b[VICLX]+\+>)=2$1
<\+\bCC\b\+>=200
<\+\bCC\b>=200<рим.ч.>
<\+\bC\b\+><\+\+>(<\+\b[VICLX]+>)=10$1
<\+\bC\b\+>(<\+\b[VICLX]+\+>)=1$1
<\+\bC\b\+>=100
<\+\bC\b>=100<рим.ч.>
<\+\bD\b\+><\+\+>(<\+\b[VICLX]+>)=50$1
<\+\bD\b\+>(<\+\b[VICLX]+\+>)=5$1
<\+\bD\b\+>=500
<\+\bD\b>=500<рим.ч.>
# десятки составные
<\+\bLXX\b\+><\+\bX\b>=80<рим.ч.>
<\+\bXX\b\+><\+\bX\b>=30<рим.ч.>
<\+\bLX\b\+><\+\bX\b>=70<рим.ч.>
<\+\bX\b\+><\+\bX\b>=20<рим.ч.>
<\+\bX\b\+><\+\bL\b>=40<рим.ч.>
<\+\bL\b\+><\+\bX\b>=60<рим.ч.>
<\+\bX\b\+><\+\bC\b>=90<рим.ч.>
#
<\+\bLXXX\b\+><\+>=80<рим.ч.>
<\+\bLXX\b\+><\+>=70<рим.ч.>
<\+\bXXX\b\+><\+>=30<рим.ч.>
<\+\bXL\b\+><\+>=40<рим.ч.>
<\+\bXC\b\+><\+>=90<рим.ч.>
<\+\bXX\b\+><\+>=20<рим.ч.>
<\+\bLX\b\+><\+>=60<рим.ч.>
<\+\bL\b\+><\+>=50<рим.ч.>
#
<\+\bLXXX\b\+>=8
<\+\bLXX\b\+>=7
<\+\bXXX\b\+>=3
<\+\bXL\b\+>=4
<\+\bXC\b\+>=9
<\+\bXX\b\+>=2
<\+\bLX\b\+>=6
<\+\bL\b\+>=5
#
<\+\bX\b\+><\+\bVIII\b>=18<рим.ч.>
<\+\bX\b\+><\+\bIII\b>=13<рим.ч.>
<\+\bX\b\+><\+\bVII\b>=17<рим.ч.>
<\+\bX\b\+><\+\bIV\b>=14<рим.ч.>
<\+\bX\b\+><\+\bVI\b>=16<рим.ч.>
<\+\bX\b\+><\+\bIX\b>=19<рим.ч.>
<\+\bX\b\+><\+\bII\b>=12<рим.ч.>
<\+\bX\b\+><\+\bV\b>=15<рим.ч.>
<\+\bX\b\+><\+\bI\b>=11<рим.ч.>
<\+\bX\b\+><\+>=10<рим.ч.>
<\+\bX\b\+>=1
#
<\+\bIV\b>=4<рим.ч.>
<\+\bIX\b>=9<рим.ч.>
<\+\bIII\b>=3<рим.ч.>
<\+\bII\b>=2<рим.ч.>
<\+\bI\b>=1<рим.ч.>
<\+\bVIII\b>=8<рим.ч.>
<\+\bVII\b>=7<рим.ч.>
<\+\bVI\b>=6<рим.ч.>
<\+\bV\b>=5<рим.ч.>
<\+\bX\b>=10<рим.ч.>
<\+\bL\b>=50<рим.ч.>
#
<\+\+>=
<\+>=
###########################################################################################
# Шаблоны с римскими числами 
# формат правил: арабская цифра + <рим.ч.> 
# напр.: 20<рим.ч.>
###########################################################################################
@(\d+)<рим\.ч\.>\s(\bго\b)=$1-ого
# в начале XIX-XX вв
(\bв\b)\s((\bначале\b|\bконце\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?((\bначале\b|\bконце\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)?(\d+)<рим\.ч\.>\s([в]{1,2}\.|\bвека\b)=$1 $2$5<td2> - $7${10}<td2> века
# в XIX-XX вв
(\bв\b|\bво\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>\s(\bвекеb|\bвеках\b)=$1 $2<td6> - $4<td6> $5
(\bв\b|\bво\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>\s([в]{1,2}\.)=$1 $2<td6> - $4<td6> векАх
# до начала XIX-XX вв
(\bдо\b|\bс\b)\s((\bначала\b|\bконца\b|\bсередины\b|(\bпервой\b|\bвторой\b)\s\bполовины\b)\s)(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?((\bначала\b|\bконца\b|\bсередины\b|(\bпервой\b|\bвторой\b)\s\bполовины\b)\s)?(\d+)<рим\.ч\.>\s([в]{1,2}\.|\bвека\b|\bвеков\b)=$1 $2$5<td2> - $7{10}<td2> века
# до XIX-XX вв
(\bдо\b|\bс\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>\s(\bвека\b|\bвеков\b)=$1 $2<td2> - $4<td2> $5
(\bдо\b|\bс\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>\s([в]{1,2}\.)=$1 $2<td2> - $4<td2> веков
# к началу XIX-XX вв
(\bк\b)\s((\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?((\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)?(\d+)<рим\.ч\.>\s([в]{1,2}\.|\bвек(у\b|ам\b))=$1 $2$5<td2> - $7{10}<td2> века
# к XIX-XX вв
(\bк\b|\bко\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>\s(\bвеку\b|\bвекам\b)=$1 $2<td3> - $4<td3> $5
(\bк\b|\bко\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>\s([в]{1,2}\.)=$1 $2<td3> - $4<td3> векАм

# в начале XIX в
(\bв\b)\s((\bначале\b|\bконце\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)(\d+)<рим\.ч\.>\s(\bв\.|\bвека\b)=$1 $2$5<td6> века
# в XIX в
(\bв\b)\s(\d+)<рим\.ч\.>\s(\bв\.|\bвеке\b)=$1 $2<td6> веке
# до начала XIX в
(\bдо\b|\bс\b)\s((\bначала\b|\bконца\b|\bсередины\b|(\bпервой\b|\bвторой\b)\s\bполовины\b)\s)(\d+)<рим\.ч\.>\s(\bв\.|\bвека\b)=$1 $2$5<td2> века
# до XIX в
(\bдо\b|\bс\b)\s(\d+)<рим\.ч\.>\s(\bв\.|\bвека\b)=$1 $2<td2> века
# к началу XIX в
(\bк\b)\s((\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)(\d+)<рим\.ч\.>\s(\bв\.|\bвека\b)=$1 $2$5<td3> века
# к XIX в
(\bк\b|\bко\b)\s(\d+)<рим\.ч\.>\s(\bв\.|\bвеку\b)=$1 $2<td3> веку
# к XIX-XX веков
(\bк\b|\bко\b)\s(\d+)<рим\.ч\.>\s?(\bи\b|\-|\,|\x20)\s?(\d+)<рим\.ч\.>\s(\bвв\.)=$1 $2<td3> $3 $4<td3> векам
(\bк\b|\bко\b)\s(\d+)<рим\.ч\.>\s?(\bи\b|\-|\,|\x20)\s?(\d+)<рим\.ч\.>\s(\bстолетий\b|\bвеков\b|\bтысячелетий\b|\bдесятилетий\b|\bсъездов\b)=$1 $2<td3> $3 $4<td3> $5
# XIX-XX веков
(\d+)<рим\.ч\.>\s?(\bи\b|\-|\,|\x20)\s?(\d+)<рим\.ч\.>\s(\bвв\.)=$1<td2> $2 $3<td2> веков
(\d+)<рим\.ч\.>\s?(\bи\b|\-|\,|\x20)\s?(\d+)<рим\.ч\.>\s(\bстолетий\b|\bвеков\b|\bтысячелетий\b|\bдесятилетий\b|\bсъездов\b)=$1<td2> $2 $3<td2> $4
# XIX-XX веках
(\d+)<рим\.ч\.>\s?(\bи\b|\-\,)\s?(\d+)<рим\.ч\.>\s(\bстолетиях\b|\bвеках\b|\bтысячелетиях\b|\bдесятилетиях\b|\bсъездах\b)=$1<td6> $3<td6> $4
# XIX веком
(\d+)<рим\.ч\.>\s(\bвеком\b|\bстолетием\b|\bтысячелетием\b|\bдесятилетием\b|\bсъездом\b)=$1<td5> $2
# XIX веке
(\d+)<рим\.ч\.>\s(\bвеке\b|\bстолетии\b|\bтысячелетии\b|\bдесятилетии\b|\bсъезде\b)=$1<td6> $2
# кон. XIX в
(\d+)<рим\.ч\.>\s(\bв\.|\bвека\b)=$1<td2> века
# XIX века
(\d+)<рим\.ч\.>\s(\bвека\b|\bстолетия\b|\bтысячелетия\b|\bдесятилетия\b|\bсъезда\b)=$1<td2> $2
# XIX век
(\d+)<рим\.ч\.>\s(\bвек\b|\bсъезд\b|\bгенеральный\b)=$1<td1> $2
# XIX генеральной
(\d+)<рим\.ч\.>\s(\bгенеральной\b)=$1<te2> $2
# XIX генеральная
(\d+)<рим\.ч\.>\s(\bгенеральная\b)=$1<te1> $2
# XIX столетие
(\d+)<рим\.ч\.>\s(\bстолетие\b|\bтысячелетие\b|\bдесятилетие\b)=$1<tc1> $2
# в XIX-XX
(\bв\b)\s(\d+)<рим\.ч\.>\s?(\,|\-)\s?(\d+)<рим\.ч\.>=$1 $2<td6> $4<td6>
# до XIX-XX
(\bдо\b|\bс\b|\bсо\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>=$1 $2<td2> - $4<td2>
# к XIX-XX
(\bк\b)\s(\d+)<рим\.ч\.>\s?(\,|\-|\x20)\s?(\d+)<рим\.ч\.>=$1 $2<td3> - $4<td3>
# до XIX
(\bдо\b)\s(\d+)<рим\.ч\.>=$1 $2<td2>
# к XIX
(\bк\b)\s(\d+)<рим\.ч\.>=$1 $2<td3>
# в XIX * главе
(\bв\b)\s(\d+)<рим\.ч\.>\s(.*)?\s(\bглаве\b)=$1 $2<te2> $3 $4
# в XIX
(\bв\b|\bна\b)\s(\d+)<рим\.ч\.>=$1 $2<td6>
# концу XIX в
(\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s(\d+)<рим\.ч\.>\s(\bв\.|\bвека\b)=$1  $3<td2> века
# концу XIX в
(\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s(\d+)<рим\.ч\.>=$1 $3<td2>
###########################################################################################
# склонение имен с римскими числительными м.р.
###########################################################################################
# Петру I (д.п.)
(\bФилиппу\b|\bЛету\b|\bШаддаму\b|\bПетру\b|\bНаполеону\b|\bАлексию\b|\bАлександру\b|\bВасилию\b|\bКарлу\b|\bГенриху\b|\bФилиппу\b|\bГеоргу\b|\bИоанну\b|\bБонифацию\b|\bБолдуину\b|\bНиколаю\b|\bКлименту\b|\bГригорию\b|\bЛюдовику\b|\bЦелестину\b|\bИннокентию\b|\bПавлу\b|\bБенедикту\b|\bСильвестру\b)\s(\d+)<рим\.ч\.>=$1 $2<td3>
# Петром I (тв.п.)
(\bФилиппом\b|\bЛетом\b|\bШаддамом\b|\bПетром\b|\bНаполеоном\b|\bАлексием\b|\bАлександром\b|\bВасилием\b|\bКарлом\b|\bГенрихом\b|\bФилиппом\b|\bГеоргом\b|\bИоанном\b|\bБонифацием\b|\bБолдуином\b|\bНиколаем\b|\bКлиментом\b|\bГригорием\b|\bЛюдовиком\b|\bЦелестином\b|\bИннокентием\b|\bПавлом\b|\bБенедиктом\b|\bСильвестром\b)\s(\d+)<рим\.ч\.>=$1 $2<td5>
# Петре I (пр.п.)
(\bФилиппе\b|\bЛете\b|\bШаддаме\b|\bПетре\b|\bНаполеоне\b|\bАлексии\b|\bАлександре\b|\bВасилии\b|\bКарле\b|\bГенрихе\b|\bФилиппе\b|\bГеорге\b|\bИоанне\b|\bБонифации\b|\bБолдуине\b|\bНиколае\b|\bКлименте\b|\bГригории\b|\bЛюдовике\b|\bЦелестине\b|\bИннокентии\b|\bПавле\b|\bБенедикте\b|\bСильвестре\b)\s(\d+)<рим\.ч\.>=$1 $2<td6>
# Петра I (р.п.)
(\bФилиппа\b|\bЛета\b|\bШаддама\b|\bПетра\b|\bНаполеона\b|\bАлексия\b|\bАлександра\b|\bВасилия\b|\bКарла\b|\bГенриха\b|\bФилиппа\b|\bГеорга\b|\bИоанна\b|\bБонифация\b|\bБолдуина\b|\bНиколая\b|\bКлимента\b|\bГригория\b|\bЛюдовика\b|\bЦелестина\b|\bИннокентия\b|\bПавла\b|\bБенедикта\b|\bСильвестра\b)\s(\d+)<рим\.ч\.>=$1 $2<td2>
# Петр I (и.п.)
(\bФилипп\b|\bЛето\b|\bШаддам\b|\bПетр\b|\bНаполеон\b|\bАлексий\b|\bАлександр\b|\bВасилий\b|\bКарл\b|\bГенрих\b|\bФилипп\b|\bГеорг\b|\bИоанн\b|\bБонифаций\b|\bБолдуин\b|\bНиколай\b|\bКлимент\b|\bГригорий\b|\bЛюдовик\b|\bЦелестин\b|\bИннокентий\b|\bПавел\b|\bБенедикт\b|\bСильвестр\b)\s(\d+)<рим\.ч\.>=$1 $2<td4>
###########################################################################################
# склонение имен с римскими числительными ж.р.
###########################################################################################
# Елизавете I (пр.п.\д.п.)
(\bЕкатерине\b|\bЕлизавете\b)\s(\d+)<рим\.ч\.>=$1 $2<te2>
# Елизаветой I (тв.п.)
(\bЕкатериной\b|\bЕлизаветой\b)\s(\d+)<рим\.ч\.>=$1 $2<te2>
# Елизаветы I (р.п.)
(\bЕкатерины\b|\bЕлизаветы\b)\s(\d+)<рим\.ч\.>=$1 $2<te2>
# Елизавета I (и.п.)
(\bЕкатерина\b|\bЕлизавета\b)\s(\d+)<рим\.ч\.>=$1 $2<te1>
# Елизавету I (в.п.)
(\bЕкатерину\b|\bЕлизавету\b)\s(\d+)<рим\.ч\.>=$1 $2<te4>
###########################################################################################
# начала XIX века
(\bначала\b|\bконца\b|\bсередины\b)\s(\d+)<рим\.ч\.>\s(\bв\.|\bвек\.|\bвека\b)=$1 $2<td2> века
# с кон. XIX в \ с кон. XIX века \ с кон. XIX век.
(\bс\b)\s(\bкон\.)\s(\d+)<рим\.ч\.>\s(\bв\.?\b|\bвек\.?\b|\bвека\b)=$1 конца $3<td2> века
# XIX уровень
(\d+)<рим\.ч\.>\s(\bуровень\b)=$1<td1> $2
# ст. XIX
(\bст\.)\s?(\d+)<рим\.ч\.>=статья $2<te1>
# т. XIX
(\bт\.)\s?(\d+)<рим\.ч\.>=том $2<td4>
# удаление лишнего
<рим\.ч\.>=
@\_([A-Z])\_=.$1.
###########################################################################################
# Шаблоны с арабскими числами 
###########################################################################################
(\d+)\s(\bмиллиард)([а-яё]+)?=$1 млрд.
(\d+)\s(\bмиллион)([а-яё]+)?=$1 млн.
(\d+)\s(\bтысяч)([а-яё]+)?=$1 тыс.
# десятичные дроби на 0,5
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s(\d+)(\,|\.)([5])\s?\x25=$1 $2<ta2> с половиной процента
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s(([1-90]+)?[2-90][01]|[01])(\,|\.)([5])\s?\°=$1 $2<ta2> с половиной градуса
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s(\d+)(\,|\.)([5])\s?\°=$1 $2<ta2> с половиной градусов
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s(\d+)(\,|\.)([5])=$1 $2<ta2> с половиной
(\bна\b)\s(\d+)(\,|\.)([5])\s?\x25=$1 $2<ta1> с половиной процента
\b([1])(\,|\.)([5])\b=полтора
\b(\d+)(\,|\.)([5])\b=$1 с половиной
# обыкновенные дроби на /3
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s([1])\s?(\/)\s?([3])\b=$1 $2<tb2> трети
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s([2-3])\s?(\/)\s?([3])\b=$1 $2<tb2> третей
(\bна\b)\s([1])\s?(\/)\s?([3])\b=$1 $2<tb4> треть
(\bна\b)\s([2-3])\s?(\/)\s?([3])\b=$1 $2<tb4> трети
\b([1])\s?(\/)\s?([3])\b=$1<tb1> треть
\b([2-3])\s?(\/)\s?([3])\b=$1<tb1> трети
# обыкновенные дроби
([\d\.\,]+)\s?(\\|\/)\s?([\d\.\,]+)\s?\x3d=$1 разделить на $3 равно
([1])\s?(\/)\s?(\d+)\b=$1<tb1> $3<te1>
([2-90])\s?(\/)\s?(\d+)\b=$1<tb1> $3<tf2>
# 1991-го\-ого
(\d+)\s(\х58|\х78|\хb5|\хb6|\х2a)\s(\d+)=$1$2$3
([\d\.\,]+)\s?(х|x|\*)\s?([\d\.\,]+)\s?\x3d=$1 умножить на $3 равно
([\d\.\,]+)\s?(\-)\s?([\d\.\,]+)\s?\x3d=$1 минус $3 равно
([\d\.\,]+)\s?(\+)\s?([\d\.\,]+)\s?\x3d=$1 плюс $3 равно
@(\d+)\s(\bти\b|\bго\b|\bх\b)=$1-$2
@(\bиз\b|\bк\b)\s(\d+)\s(\bй\b)=$1 $2-й
@(\d+)\s(\bй\b)=$1-ый
@(\d+)\s(\bю\b)=$1-$2
@(\d{2,4})\s(\bе\b)=$1-ые
@([1])\s(\bшт\.|\bшт\b)=$1 штука
@([2-4])\s(\bшт\.|\bшт\b)=$1 штуки
@([5-90])\s(\bшт\.|\bшт\b)=$1 штук
(\d{2,4})\s?\-\s?(\bго\b)=$1-ого
(\d{2,4})\s?\-\s?(\bти\b)=$1-го
# 1991-е\-ые
(\d{4})\s?\-\s?(\bе\b)=$1-ые
# 20-ть
([0])\s?\-\s?(\bть\b)=$1
# 1-ое
(\d+)\-(\bое\b)=$1-е
# 1-ая
(\d+)\-(\bая\b)=$1-я
#3-ей
(\d+)\-(\bей\b)=$1-й
# 21 ый
(\d+)\s(\bый\b)=$1-$2
# 33-ий
(\d+)\-(\bго\b)(\s([А-Яа-яёЁ]+))?\s(\bпо\b)\s(\d+)\-(\bий\b)=$1-ого$3 $5 $6-ый
(\d+)\-(\bий\b)=$1-ый
# на 2-ом
(\bна\b)\s(\d+)\-(\bом\b)=$1 $2-м
# 21-й\-ый
(\d+)\s?\-\s?(\bй\b)\s(\bномер\b|\bгод\b|\bвек\b|\bдень\b|\bквартал\b|\bчас\b|\bпо счету\b|\bтур\b|\bэтап\b|\bтранш\b|\bсезон\b|\bконцерт\b|\bпакет\b|\bкласс\b|\bэтаж\b|\bпроем\b|\bповорот\b|\bзакон\b|\bразмер\b)=$1-ый $3
(\d+)\s?\-\s?(\bй\b)\s([А-Яа-яёЁ\-]+)(кий\b|ный\b)=$1-ый $3$4
# 27-ю группами
(\d+)\s?\-\s?(\bю\b)\s([А-Яа-яёЁ\-]+)(ами\b)=$1-им $3$4
# 21-ой\-й
(\d+)\s?\-\s?(\bой\b)=$1-й
# 21-ти\-ой
(\d+)\s?\-\s?(\bти\b)=$1-ой
# 21-м\-ым
(ало\b|али\b|ала\b|ал\b)\s(\d+)\s?\-\s?(\bм\b)=$1 $2-ым
# с 5-го
(\bс\b)\s(\d+)\-(\bго\b)=$1 $2-о$3
# до 3-х\-го
(\d)\-(\bх\b|\bx\b|\bи\b)\s(\bлет\b|\bдней\b|\bнедель\b|\bминут\b|\bчасов\b|\bсекунд\b)=$1 $3
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)(\s[а-яё\-]+)?\s(\d)\-(\bх\b|\bx\b|\bи\b)=$1$2 $3-го
# 3%-ах
(\d+)\s?(\%)\-(\bа?х\b)=$1<t6><per>
# 14-часового
(\d+)\-([а-яё]+)(ого\b)=$1<ta6> $2$3
# дата ----------------------------------------------------------------
# (8апр с.р.им.п. t=1/2)
(\d+)\s?\bянв\.?\b=$1 <mm:1:t1>
(\d+)\s?\bфев\.?\b=$1 <mm:2:t1>
(\d+)\s?\bмар\.?\b=$1 <mm:3:t1>
(\d+)\s?\bапр\.?\b=$1 <mm:4:t1>
(\d+)\s?\bмай\.?\b=$1 <mm:5:t1>
(\d+)\s?\bиюн\.?\b=$1 <mm:6:t1>
(\d+)\s?\bиюл\.?\b=$1 <mm:7:t1>
(\d+)\s?\bавг\.?\b=$1 <mm:8:t1>
(\d+)\s?\bсен\.?\b=$1 <mm:9:t1>
(\d+)\s?\bокт\.?\b=$1 <mm:10:t1>
(\d+)\s?\bноя\.?\b=$1 <mm:11:t1>
(\d+)\s?\bдек\.?\b=$1 <mm:12:t1>
(\d+)\s?<mm:(\d+):t1>=$1<tc1> <mm:$2:t2>
#(dd-mm-yy -> dd-mm-yyyy 1900-2000) 
#\b(3[01]|[0-2]?[0-9])(\.|\-|\/)(1[0-2]|0?[1-9])(\.|\-|\/)([01]?[0-9])\b=$1$2$3$420$5
#\b(3[01]|[0-2]?[0-9])(\.|\-|\/)(1[0-2]|0?[1-9])(\.|\-|\/)([2-9]?[0-9])\b=$1$2$3$419$5
#(dd-mm-yy, dd-mm-yyyy) 
\b(3[01]|[0-2]?[0-9])(\-)(1[0-2]|0?[1-9])(\-)(\d{4})\b=$1<t1><dd> $3<t2><mm> $5<t2><yy>
\b(3[01]|[0-2]?[0-9])(\-)(1[0-2]|0?[1-9])(\-)(\d{2})\b=$1<t1><dd> $3<t2><mm> $5<t2><yy>
#(dd.mm.yy, dd.mm.yyyy) 
\b(3[01]|[0-2]?[0-9])(\.)(1[0-2]|0?[1-9])(\.)(\d{4})\b=$1<t1><dd> $3<t2><mm> $5<t2><yy>
\b(3[01]|[0-2]?[0-9])(\.)(1[0-2]|0?[1-9])(\.)(\d{2})\b=$1<t1><dd> $3<t2><mm> $5<t2><yy>
#(dd/mm/yy, dd/mm/yyyy) 
\b(3[01]|[0-2]?[0-9])(\/)(1[0-2]|0?[1-9])(\/)(\d{4})\b=$1<t1><dd> $3<t2><mm> $5<t2><yy>
\b(3[01]|[0-2]?[0-9])(\/)(1[0-2]|0?[1-9])(\/)(\d{2})\b=$1<t1><dd> $3<t2><mm> $5<t2><yy>
# январь 1991 года
(\bянв|\bфев|\bмар|\bапр|\bмае|\bиюн|\bиюл|\bавг|\bсен|\bокт|\bноя|\bдек)([а-яё]+)\s(\d+)\s(\bгода\b|\bг\.|\bгод\.)=$1$2 $3<ta2> гОда
(\bянв|\bфев|\bмар|\bапр|\bмае|\bиюн|\bиюл|\bавг|\bсен|\bокт|\bноя|\bдек)([а-яё]+)\s(\d+)=$1$2 $3-ого
# по 1 января
(\bпо\b)\s(\d{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=$1 $2<tc1> $3
# с 1 января
(\bс\b)\s(\d{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=$1 $2<tc2> $3
# на 1 января
(\bна\b)\s(\d{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=$1 $2<tc1> $3
# 1-2 января
(\d{1,2})\s?(\bи\b|\-|\bпо\b|\bдо\b)\s?(\d{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=$1<tc2> $2 $3<tc2> $4
# 1 января
(\d{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=$1<tc2> $2
# ---------------------------------------------------------
# между 1991-1992 годами
(\bмежду\b)\s(\d{1,4})\-?(\bым\b)?\s?\-?(\bи\b)?\s?(\d{1,4})\-?(\bым\b)?\s(\bгодами\b|\bгг\.|\bгод\.?\b)=$1 $2<td5> и $5<td5> годАми
# между 1991-м
(\bмежду\b)\s(\d+)\s?\-\s?(\bм\b)=$1 $2-ым
# этому 1991 году
(\bэтому\b)\s(\d+)\s(\bгоду\b|\bг\.)=$1 $2-ому гОду
# году в 1991
(\bгоду\b)\s(\bв\b)\s(\d+)\-?(\bм\b)?=годУ $2 $3-м
# с 1991-1992 год
(\bс\b|\bсо\b)\s(\d+)\s?(\,|\-|\bдо\b|\bпо\b)\s?(\d+)\s(\bгг\.|\bгод\.?\b|\bгода\b|\bгоды\b)=$1 $2<td2> по $4<td1> год
# с кон. 19 в \ с кон. 19 век.
(\bс\b)\s(\bкон\.)\s(\d+)\s(\bв\.?\b|\bвек\.?\b)=$1 конца $3<td2> века
# с кон. 19 века
(\bс\b)\s(\bкон\.)\s(\d+)\s(\bвека\b)=$1 конца $3<td2> века
# кон. 19 в \ с кон. 19 век.
(\bкон\.)\s(\d+)\s(\bв\.?\b|\bвек\.?\b)=конец $2<td2> века
# кон. 19 века
(\bкон\.)\s(\d+)\s(\bвека\b)=конец $2<td2> века
#
(\d+)\s(\bвек\b|\bстолетие\b|\bтысячелетие\b|\bдесятилетие\b)=$1<tc1> $2
(\d+)\s(\bвеком\b|\bстолетием\b|\bтысячелетием\b|\bдесятилетием\b)=$1<td5> $2
(\d+)\s(\bвеке\b|\bстолетии\b|\bтысячелетии\b|\bдесятилетии\b)=$1<td6> $2
(\d+)\s(\bвеку\b|\bстолетию\b|\bтысячелетию\b|\bдесятилетию\b)=$1<td3> $2
(\d+)\s(\bвека\b|\bстолетия\b|\bтысячелетия\b|\bдесятилетия\b)=$1<td2> $2
(\d+)\s(\bвекам\b|\bстолетиям\b|\bтысячелетиям\b|\bдесятилетиям\b)=$1<td3> $2
(\d+)\s(\bвеками\b|\bстолетиями\b|\bтысячелетиями\b|\bдесятилетиями\b)=$1<tf5> $2
(\d+)\s(\bвеках\b|\bстолетиях\b|\bтысячелетиях\b|\bдесятилетиях\b)=$1<ta6> $2
# с 1991 года
(\bс\b|\bдо\b|\bпосле\b)\s(\d+)\s(\bг\.|\bгод\.?\b|\bгода\b)=$1 $2<td2> гОда
# в 1991-1992 гг
(\bв\b)\s(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})\s(\bгодах\b|\bгг\.|\bгод\.?\b)=$1 $2<td6> $3 $4<td6> годах
# до 1991-1992 гг
(\bдо\b|\bкон\.|\bконца\b|\bконце\b|\bконцу\b|\bна\b\s\bрубеже\b)\s(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})\s(\bгодов\b|\bгг\.|\bгод\.?\b)=$1 $2<td2> $3 $4<td2> годов
# к 1991-1992 гг
(\bк\b|\bко\b)\s(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})\s(\bгодов\b|\bгг\.|\bгод\.?\b)=$1 $2<td3> $3 $4<td3> годам
# в 1991-1992 году
(\bв\b)\s(\d{2,4})\s(\bи\b|\-)?\s?(\d{2,4})\s(\bгоду\b)=$1 $2-м $4-м годУ
# 1991-1992 годами
(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})\s(\bгодами\b)=$1-ым $2 $3-ым $4
# 1991-1992 годов
(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})\s(\bгодов\b)=$1<td2> $2 $3<td2> $4
#в 1996 и в 1997 годах
(\d{2,4})\s?(\bи\b|\-)\s?(\bв\b\s)?(\d{2,4})\s(\bгодах\b)=$1-м $2 $4-м $5
# в 1991-1992
(\bв\b|\bво\b)\s(\d+)\s?(\,|\-)\s?(\d+)=$1 $2-м $4-м
# 1991-1992 гг
(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})\s(\bгодов\b|\bгг\.|\bгод\.?\b)=$1<td2> $2 $3<td2> годов
# в 1991 году
(\bв\b)\s(\d+)\s(\bгоду\b|\bг\.|\bгод\.?\b)=$1 $2-м годУ
# в 90-х гг
(\bв\b)\s(\d+)(\-(\bx\b|\bх\b|\bых\b))\s(\bгг\.)=$1 $2<tf2> годах
# до 90-х гг
(\bкон\.)\s(\d+)(\-(\bx\b|\bх\b|\bых\b))\s(\bгг\.)=конец $2<tf2> годов
(\bс\b|\bдо\b|\bконца\b|\bконце\b|\bконцу\b|\bна\b\s\bрубеже\b)\s(\d+)(\-(\bx\b|\bх\b|\bых\b))\s(\bгг\.)=$1 $2<tf2> годов
# к 90-х гг
(\bк\b)\s(\d+)(\-(\bм\b|\bым\b))\s(\bгг\.)=$1 $2<td5> годам
# в 19 веке
(\bв\b)\s(\d+)\s(\bвеке\b|\bв\b|\bв\.)=$1 $2-м веке
# к 1991-1992 году
(\bк\b|\bко\b)\s(\d{2,4})\s?(\bи\b|\-)\s?(\d{2,4})(\s(\bгоду\b|\bг\.|\bгг\.|\bгод\.))=$1 $2-ому $4-ому гОду
# к 1991 году
(\bк\b|\bко\b)\s(\d{2,4})(\s(\bгоду\b|\bг\.|\bгод\.))=$1 $2-ому гОду
(\bк\b|\bко\b)\s(\d+)\s(\bгоду\b|\bг\.|\bгод\.)=$1 $2-ому гОду
# на 1991 год
(\bна\b|\bпо\b)\s(\d+)\s(\bг\.|\bгод\.?\b)=$1 $2-ый год
# о 1945 годе
(\bо\b)\s(\d+)\s(\bгоде\b|\bг\.|\bгод\.?\b)=$1 $2-м гОде
# начале 19 в
(\bначале\b)\s(\d+)\s(\bв\b)=$1 $2<td2> века
# на 5 холмах
(\bна\b)\s(\d+)\s(\bхолмах\b)=$1 $2-го $3
# за 1991-1992
(\bза\b)\s(\d{4})\s?(\,|\-)\s?(\d{4})=$1 $2-ый $4-ый
# на протяжении 1991
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s(\d+)\s?(\bсекунды\b|\bсек\.?\b)=$1 $2<t2><sec>
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s(\d+)\s?(\bминуты\b|\bмин\.?\b)=$1 $2<t2><min>
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s(\d+)\s?(\bчаса\b|\bчас\.?\b)=$1 $2<t2><hr>
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s(\d+)\s?(\bмесяца\b|\bмес\.?\b)=$1 $2<ta2><mnth>
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)(\s([а-яё]+))?\s(\d+)\s(([а-яё]+)\s)?(\bлет\b|\bдней\b|\bнедель\b|\bминут\b|\bчасов\b|\bсекунд\b)=$1$2 $4<ta2> $5$7
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s(\d+)\s?(\bнедели\b)=$1 $2<tb2><wek>
(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s(\d+)([^\-\d])=$1 $2<td2>$3
# стоит в 5 раз
(\bстоит\b)\s(\bв\b)\s(\d+)\s(\bраз\b)=стОит $2 $3 $4
# 18 века
(\d+)\s(\bвека\b|\bкласса\b)=$1<td2> $2
# 1991 и 1992 года
(\d{1,2})\s([а-яё]+)\s(\d{2,4})\s(\bгода\b)=$1<td2> $2 $3<td2> $4
# по 1991 году
(\bпо\b)\s(\d{2,4})\s(\bгоду\b)=$1 $2<td3> $3
# 1991 года
((\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)\s)?(\d{2,4})\s(\bг\.)=$1$3<td2> гОда
(\d{2,4})\s(\bгода\b)=$1<td2> гОда
# 18 годам
(\d+)\s(\bгодам\b)=$1<ta3> $2
# 18 годах
(\d+)\s(\bгодах\b)=$1-х $2
# квартале 1991 год.
(\bквартал)([а-яё]+)?\s(\d{2,4})\s(\bгод\.|\bг\.)=$1$2 $3-ого гОда
# 1991 годом
(\d{2,4})\s(\bгодом\b)=$1-ым $2
# 1991 году
(\d{2,4})\s(\bгоду\b)=$1<td6> $2
# 1991 год
(\d{2,4})\s(\bгод\b|\bг\.)=$1-ый год
# год 1991
(\bгод\b)\s(\d{4})=$1 $2-ый
# 10-е годы
(\d+)\s?\-\s?(\bе\b)\s(\bгоды\b)=$1<tf1> $3
# Конец 1993 
(\bконец\b|\bначало\b|\bсередина\b)\s(\d+)([^\-\dа-яё]+)=$1 $2<td2>$3
# зимой 1993 
(\bзим|\bвесн|\bлет|\bосен)([а-яё]+)\s(\d+)([^\-\dа-яё]+)=$1$2 $3<td2> $4
# новая строка - 1,2,3... - новая строка
#([\r\n]{2,99})(\d+)([\r\n]{2,99})=$1глава $2$3
# эпизод 1
(\bэпизод\b|\bраздел\b|\bквартал\b)\s(\d+)([^\-\d+])?=$1 $2-ый$3...
#
(\bза\b)\s(\d+)\s(\bквартал\b|\bкв\.)=$1 $2-ый квартал
(\bв\b)\s(\d+)\s(\bквартале\b|\bкв\.)=$1 $2-м квартале
(\bконца\b|\bконце\b|\bсередине\b|\bначале\b|\bтечение\b)\s(\d+)\s(\bквартала\b|\bкв\.)=$1 $2-ого квартала
# глава 1
(\bглава\b|\bчасть\b|\bкнига\b|\bсерия\b)\s(\d+)([^\-\d+])?=$1 $2-я$3...
# 1 серия
(\d+)\s(\bсерия\b|\bглава\b|\bчасть\b)=$1-я $2...
# до 5 лет
(\bс\b|\bдо\b|\bпосле\b|\bмоложе\b|\bстарше\b|\bиз\-за\b)\s(\d+)\s(\bлет\b|\bчасов\b)=$1 $2<ta2> $3
(\bсо\b|\bс\b|\bдо\b|\bпосле\b|\bмоложе\b|\bстарше\b|\bиз\-за\b)\s(\d+)\s(\bмес\.|\bмесяца\b)=$1 $2<t2><mnth>
(\bсо\b|\bс\b|\bдо\b|\bпосле\b|\bмоложе\b|\bстарше\b|\bиз\-за\b)\s(\d+)\s(\bнедели\b)=$1 $2<t2><wek>
(\bсо\b|\bс\b|\bдо\b|\bпосле\b|\bмоложе\b|\bстарше\b|\bиз\-за\b)\s(\d+)\s(\bгода\b)=$1 $2<td2> $3
#
(\bвозрасте\b)\s(\d+)=$1 $2<ta2>
# 2 половине
(\d+)\s(\bэпохе\b|\bполовине\b|\bдекаде\b)=$1-й $2
# 2-ой половине
(\d+)\s?(\-)\s?(\bой\b)\s(\bэпохе\b|\bполовине\b|\bдекаде\b)=$1-й $4
# 8-летним
(\d+)\s?(\bлетн)(его\b|ий\b|ему\b|им\b|ем\b|яя\b|ей\b|юю\b|ею\b|ее\b|их\b|ие\b|ими\b)=$1-$2$3
([2-9]|\d{2,})\s?(\-)\s?(\bлетн)(его\b|ий\b|ему\b|им\b|ем\b|яя\b|ей\b|юю\b|ею\b|ее\b|их\b|ие\b|ими\b)=$1-го del_space$3$4
(1)\s?(\-)\s?(\bлетн)(его\b|ий\b|ему\b|им\b|ем\b|яя\b|ей\b|юю\b|ею\b|ее\b|их\b|ие\b|ими\b)=$1-о del_space$3$4
# 9-миллиметрового
(\d+)\s?(\-)\s?([а-яё]+)?(метр)([а-яё]+)=$1-го del_space$3$4$5
#
(\d+)\s?(\-)\s?(\bмм\b)=$1-го $3
(\bмм\b)\s(\bкалибр\b)=миллиметровый $2
(\bмм\b)\s(\bкалибра\b)=миллиметрового $2
(\bмм\b)\s(\bкалибрам\b|\bкалибром\b)=миллиметровым $2
(\bмм\b)\s(\bкалибрами\b)=миллиметровыми $2
(\bмм\b)\s(\bкалибрах\b|\bкалибров\b)=миллиметровых $2
(\bмм\b)\s(\bкалибре\b)=миллиметровом $2
(\bмм\b)\s(\bкалибру\b)=миллиметровому $2
(\bмм\b)\s(\bкалибры\b)=миллиметровые $2
(\bмм\b)\s(\bкамера\b)=миллиметровая $2
(\bмм\b)\s(\bкамер\b)=миллиметровых $2
(\bмм\b)\s(\bкамеры\b)=миллиметровой $2
#(\bмм\b)\s(\bкамеры\b)=миллиметровые $2
(\bмм\b)\s(\bкамерам\b)=миллиметровым $2
(\bмм\b)\s(\bкамерами\b)=миллиметровыми $2
(\bмм\b)\s(\bкамерах\b)=миллиметровых $2
(\bмм\b)\s(\bкамере\b|\bкамерой\b|\bкамерою\b)=миллиметровой $2
(\bмм\b)\s(\bкамеру\b)=миллиметровую $2
# 5-звездочных
(\d+)\s?\-\s?(\bзвезд|\bмароч|\bкамерн|\bдверн|\bстворч|\bсторонн|\bклапанн)=$1<ta2> $2
# 20 килотонной \ 20-килотонной 
([2-9]|\d{2,})\s?(\-)?\s?(\bкило|\bгига|\bмега|\bсанти|\bмили|\bметро|\bтонн)([а-яё]+)?(ая\b|ого\b|ое\b|ой\b|ом\b|ому\b|ою\b|ую\b|ые\b|ый\b|ым\b|ыми\b|ых\b)=$1-го del_space$3$4$5
(1)\s?(\-)?\s?(\bкило|\bгига|\bмега|\bсанти|\bмили|\bметро|\bтонн)([а-яё]+)?(ая\b|ого\b|ое\b|ой\b|ом\b|ому\b|ою\b|ую\b|ые\b|ый\b|ым\b|ыми\b|ых\b)=$1-о del_space$3$4$5
# 5x5
([\d]+)\s?(x|х)\s?([\d]+)=$1 на $3
# 19 этаже\2 квартале\5 классе
(\d+)\s(\bэтаже\b|\bквартале\b|\bклассе\b)=$1-м $2
# 19 этаж\2 квартал\5 класс
(\d+)\s(\bэтаж\b|\bквартал\b|\bкласс\b|\bэтап\b)=$1-ый $2
# 200 летия \ 200-летия
([2-9]|\d{2,})\s?(\-)?\s?(\bлети)(е\b|я\b|ю\b|ем\b|и\b)=$1-го del_space$3$4
(1)\s?(\-)?\s?(\bлети)(е\b|я\b|ю\b|ем\b|и\b)=$1-о del_space$3$4
# более 1% 
(\bсо\b|\bс\b|\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\x25)=$1 $2<t2><per>
(\bна\b)\s(\d+)\s?(\x25)=$1 $2<t1><per>
# более 1 
#(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)=$1 $2<ta2>
(\bсо\b|\bс\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)\s?\-\s?(\d+)([^\<\-\d+])=$1 $2<ta2> - $3<ta2>$4
(\bсо\b|\bс\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)([^\<\-\d+\.\,\\\/\:])=$1 $2<ta2>$3
#
(\bиз\b)\s(\d+)=$1 $2<ta2>
# равная 1% 
(\bравная\b|\bравный\b|\bравное\b)\s(\d+)\s?(\x25)=$1 $2<t2><per>
# равная 1 
#(\bравная\b|\bравный\b|\bравное\b)\s(\d+)=$1 $2<ta3>
# в 1 книге
(\bво\b|\bв\b|\bко\b|\bк\b)\s(\d+)\s(\bглаве\b|\bчасти\b|\bкниге\b|\bэпохе\b|\bполовине\b|\bдекаде\b)=$1 $2-й $3
#
(\bглаве\b|\bчасти\b|\bкниге\b)\s(\d+)=$1 $2-й
# в 10 раз говорю 
(\bво\b|\bв\b)\s(\d+)\s(\bраз\b)\s(\bговорю\b|\bповторяю\b|\bпрошу\b)=$1 $2-ый $3 $4
# в 10% случаев
(\bв\b)\s(\d+)\s?(\x25)\s(\bслучаев\b)=$1 $2<t2><per> $4
# в возрасте 10 
(\bв\b)\s(\bвозрасте\b)\s(\d+)=$1 $2 $3-го
# итогам 1990 г 
(\bитогам\b|\bконце\b|\bпосле\b)\s(\d+)\s?(\bгода\b|\bг\.)=$1 $2-ого гОда
# итогам 10
(\bитогам\b|\bпосле\b)\s(\d+)=$1 $2<ta2>
# на 2 месте
(\bна\b)\s(\d+)\s(\bместе\b)=$1 $2-м $3
# 1 созыва
(\d+)\s(\bсозыва\b|\bсъезда\b|\bчисла\b)=$1-ого $2
# порядка 9-10 \ порядка 9
(\bпорядка\b|\bрасстоянии\b|\bналичие\b)\s(\d+)\s?\-\s?(\d+)=$1 $2<ta2> $3<ta2>
(\bпорядка\b|\bрасстоянии\b|\bналичие\b)\s(\d+)([^\<\-\d+])=$1 $2<ta2>$3
# недели 2-3 / недели 2
(\bнедели\b|\bштуки\b)\s(\d+)\s?\-\s?(\d+)=$1 $2<tb1> $3<tb1>
(\bнедели\b|\bштуки\b)\s(\d+)\b=$1 $2<tb1>
# по 1 экз 
(\bпо\b)\s((\d+)?([02-9])(1)|(1))\s(\bэкз\.?\b)=$1 $2-му экземпляру
(\bпо\b)\s((\d+)?([02-9])([2-4])|([2-4]))\s(\bэкз\.?\b)=$1 $2 экземпляра
(\bпо\b)\s(\d+)\s(\bэкз\.?\b)=$1 $2 экземпляров
# ст. 1
(\bст\.)\s?(\d+)=статья $2-я
# т. 1
(\bт\.)\s?(\d+)=том $2-ый
# соотношение 2:3
(\bсоотношен|\bотношен)([а-яё]+)\s(\d+)\s?\:\s?(\d+)=$1$2 $3 к $4<ta3>
# на 1000
(\bна\b)\s(\d+)([^\-\<\d])=$1 $2<tb4>$3
# время --------------------------------------------------------------
# около 18:45:18
(\bоколо\b)\s(\d{1,2})\s?\:\s?(\d{1,2})\s?\:\s?(\d{1,2})=$1 $2<t2><hr>$3<t2><min> и $4<t2><sec>
# около 18:45
(\bоколо\b)\s(\d{1,2})\s?\:\s?(\d{1,2})=$1 $2<t2><hr>$3<t2><min>
# 18:45:18
#(\d+)\s?\:\s?(\d+)\s?\:\s?(\d+)=$1<t1><hr>$2<t1><min>$3<t1><sec>
# 18:45
#(\d+)\s?\:\s?(\d+)=$1<t1><hr>$2<t1><min>
# 18час\18ч
\b(\d{1,2})(<[a-z]+>)?\s?(\bчас\.?\b|\bч\.?\b)=$1<ta1><hr>
# на 1-2 мин
(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bна\b|\bот\b)\s(\d{1,2})\s?\-\s?(\d+)\s(\bмин\b|\bминуту\b|\bминуты\b|\bминут\b)=$1 $2<tb4> $3<t4><min>
# на 45мин
(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bна\b|\bот\b)\s(\d{1,2})(<[a-z]+>)?\s?(\bмин\.?\b|\bmin\.?\b)=$1 $2<tb4><min>
# 45мин
\b(\d{1,2})(<[a-z]+>)?\s?(\bмин\.?\b|\bmin\.?\b)=$1<t1><min>
# на 18сек
(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bна\b|\bот\b)\s(\d{1,2})(<[a-z]+>)?\s?(\bм|\bm)?(s\.?\b|sec\.?\b|с\.?\b|сек\.?\b)=$1 $2<tb4> $4$5
# 18сек
\b(\d{1,2})(<[a-z]+>)?\s?(\bм|\bm)?(s\.?\b|sec\.?\b|с\.?\b|сек\.?\b)=$1<t1> $3$4
# длина-------------------------------------------------------------
# около 15км
@(\bна\b\s\bрасстоянии\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)(<[a-z]+>)?\s?(\bk|\bm|\b mk|\bs|\bк|\bм|\bмк|\bс)?(м\.?\b|m\.?\b)=$1 $2<ta2> $4$5
# 15км
@\b(\d+)(<[a-z]+>)?\s?(\bk|\bm|\b mk|\bs|\bк|\bм|\bмк|\bс)?(м\.?\b|m\.?\b)=$1<t1> $3$4
# вес----------------------------------------------------------------
# около 15гр
@(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)(<[a-z]+>)?\s?(\bk|\bml|\b mk|\bк|\bм|\bмк)?(гр\.?\b|gr\.?\b)=$1 $2<t2> $4$5
# 15гр
@(\d+)\s?(<[a-z]+>)?\s?(\bk|\bml|\b mk|\bк|\bм|\bмк)?(гр\.?\b|gr\.?\b)=$1<t1>$2 $3$4
# около 15т
@(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)(<[a-z]+>)?\s?(т\.?\b|t\.?\b)=$1 $2<t2> $3$4
# 15т
@(\d+)(<[a-z]+>)?\s?(т\.?\b|t\.?\b)=$1<t1> $2$3
# объем ---------------------------------------------------------------
# около 5л
@(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)(<[a-z]+>)?\s?(\bm|\bм)?(л\.?\b|l\.?\b)=$1 $2<t2> $4$5
# 5л
@(\d+)(<[a-z]+>)?\s?(\bm|\bм)?(л\.?\b|l\.?\b)=$1<t1> $3$4
# валюта ---------------------------------------------------------------
# около 100$\100дол.
(коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bдо\b|\bот\b)\s(\d+)\s?(\x24|\bдолл\.?\b|\bдол\.?\b)=$1 $2<t2><usd>
# около $100
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\x24)+\s?(\d+)([^\,\d])=$1 $3<t2><usd>$4
# 100$\100дол.
([^\,\d])(\d+)\s?(\x24|\bдолл\.?\b|\bдол\.?\b)=$1$2<t1><usd>
# $100
(\x24)+\s?(\d+)([^\,\d])=$2<t1><usd>$3
# около 10цент.
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\x{00a2}|\bцент\.?\b)=$1 $2<t2><cnt>
# 10цент.
([^\,\d])(\d+)\s?(\x{00a2}|\bцент\.?\b)=$1$2<t1><cnt>
# около 100руб
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\bруб\.?\b)=$1 $2<t2><rub>
# 100руб
([^\,\d])(\d+)\s?(\bруб\.?\b)=$1$2<t1><rub>
# около 10коп
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\bкоп\.?\b)=$1 $2<t2><kop>
# 10коп
([^\,\d])(\d+)\s?(\bкоп\.?\b)=$1$2<t1><kop>
# около 100€\100евро
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\x88|\x{20ac}|\bевр\.?\b)=$1 $2<t2><eur>
# около €100
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\x88|\x{20ac})+\s?(\d+)=$1 $3<t2><eur>
# 100€\100евро
([^\,\d])(\d+)\s?(\x88|\x{20ac}|\bевр\.?\b)=$1$2<t1><eur>
# €100
(\x88|\x{20ac})\s?(\d+)([^\,\d])=$2<t1><eur>$3
# около 100грн
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\x{20b4}|\bгрн\.?\b)=$1 $2<t2><grn>
# около €100
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\x{20b4})\s?(\d+)=$1 $3<t2><grn>
# 100€\100евро
([^\,\d])(\d+)\s?(\x{20b4}|\bгрн\.?\b)=$1$2<t1><grn>
# €100
(\x{20b4})\s?(\d+)([^\,\d])=$2<t1><grn>$3
# около 10евроцент.
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)\s?(\bевроцент\.?\b)=$1 $2<t2><ecn>
# 10евроцент.
([^\,\d])(\d+)\s?(\bевроцент\.?\b)=$1$2<t1><ecn>
# координаты---------------------------------------------------------------
# 41° с. ш.\ °41 с. ш.
((\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?)\s\bс\.\s\bш\.=$1 северной широтЫ
((\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?)\s\bс\.\s\bш\.=$1 северной широтЫ
# 41° ю. ш.\ °41 ю. ш.
((\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?)\s\bю\.\s\bш\.=$1 южной широтЫ
((\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?)\s\bю\.\s\bш\.=$1 южной широтЫ
# 41° в. д.\ °41 в. д.
((\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?)\s\bв\.\s\bд\.=$1 восточной долготЫ
((\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?)\s\bв\.\s\bд\.=$1 восточной долготЫ
# 41° з. д.\ °41 з. д.
((\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?)\s\bз\.\s\bд\.=$1 западной долготЫ
((\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?)\s\bз\.\s\bд\.=$1 западной долготЫ
# после 41° 
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s(\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?=$1 $2<t2><gra> $5<t2><min> $8<t2><sec>
(\bпри\b)\s(\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?=$1 $2<t6><gra> $5<t6><min> $8<t6><sec>
# 41° 
(\d+)(\°)(\s?(\d+)\s?(\'))?(\s?(\d+)\s?(\"))?=$1<t1><gra> $4<t1><min> $7<t1><sec>
# после °41
(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s(\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?=$1 $3<t2><gra> $6<t2><min> $9<t2><sec>
(\bпри\b)\s(\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?=$1 $3<t6><gra> $6<t6><min> $9<t6><sec>
# °41
(\°)(\d+)(\s?(\')(\d+))?(\s?(\")(\d+))?=$2<t1><gra> $5<t1><min> $8<t1><sec>
# биты и байты-------------------------------------------------------
# около 100Гб
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)(<[a-z]+>)?\s?([А-Яа-яA-Za-z]+)?(байт\.?\b|б\.?\b|b\.?\b|byte\.?\b)=$1 $2<t2> $4$5
# 100Гб
(\d+)(<[a-z]+>)?\s?([А-Яа-яA-Za-z]+)?(байт\.?\b|б\.?\b|b\.?\b|byte\.?\b)=$1<t1> $3$4
# около 100Мбит
(\bоколо\b|\bсвыше\b|\bприблизительно\b|\bболее\b|\bбольше\b|\bпределах\b|\bдо\b|\bменее\b|\bменьше\b|\bот\b)\s(\d+)(<[a-z]+>)?\s?([А-Яа-яA-Za-z]+)?(бит\.?\b|bit\.?\b)=$1 $2<t2> $4$5
# 100Мбит
(\d+)(<[a-z]+>)?\s?([А-Яа-яA-Za-z]+)?(бит\.?\b|bit\.?\b)=$1<t1> $3$4
# ----------------------------------------------------------------------------------------------------
# порядки
#
(\d+)\s?(<[a-z\d]+>)?\s?(км\.?\b|km\.?\b)=$1$2 <kilo><mt>
(\d+)\s?(<[a-z\d]+>)?\s?(мкм\.?\b|mkm\.?\b)=$1$2 <micro><mt>
(\d+)\s?(<[a-z\d]+>)?\s?(мм\.?\b|mm\.?\b)=$1$2 <mili><mt>
(\d+)\s?(<[a-z\d]+>)?\s?(см\.?\b|cm\.?\b)=$1$2 <santi><mt>
(\d+)\s?(<[a-z\d]+>)?\s?(м\.?\b|m\.?\b)=$1$2 <mt>
#
\b(\d{1,2})\s?(<[a-z\d]+>)?\s?(ms\.?\b|msec\.?\b|мс\.?\b|мсек\.?\b)=$1$2 <mili><sec>
\b(\d{1,2})\s?(<[a-z\d]+>)?\s?(s\.?\b|sec\.?\b|с\.?\b|сек\.?\b)=$1$2 <sec>
\b(\d{1,2})\s?(<[a-z\d]+>)?\s?(\bмин\.?\b|\bmin\.?\b)=$1$2 <min>
\b(\d{1,2})\s?(<[a-z\d]+>)?\s?(\bчас\.?\b|\bч\.?\b)=$1$2 <hr>
#
(\d+)\s?(<[a-z\d]+>)?\s?(гр\.?\b|gr\.?\b)=$1$2 <gr>
(\d+)\s?(<[a-z\d]+>)?\s?(кг\.?\b|kg\.?\b)=$1$2 <kilo><gr>
(\d+)\s?(<[a-z\d]+>)?\s?(мг\.?\b|mg\.?\b)=$1$2 <mili><gr>
(\d+)\s?(<[a-z\d]+>)?\s?(т\.?\b|t\.?\b)=$1$2 <tn>
(\d+)\s?(<[a-z\d]+>)?\s?(мт\.?\b|mt\.?\b)=$1$2 <mega><tn>
(\d+)\s?(<[a-z\d]+>)?\s?(кт\.?\b|kt\.?\b)=$1$2 <kilo><tn>
#
(\d+)\s?(<[a-z\d]+>)?\s?(мл\.?\b|ml\.?\b)=$1$2 <mili><lt>
(\d+)\s?(<[a-z\d]+>)?\s?(л\.?\b|l\.?\b)=$1$2 <lt>
#
(\d+)\s?(<[a-z\d]+>)?\s?(Тб\.?\b|Tb\.?\b)=$1$2 <tera><byt>
(\d+)\s?(<[a-z\d]+>)?\s?(Гб\.?\b|Gb\.?\b)=$1$2 <giga><byt>
(\d+)\s?(<[a-z\d]+>)?\s?(Мб\.?\b|Mb\.?\b)=$1$2 <mega><byt>
(\d+)\s?(<[a-z\d]+>)?\s?(Кб\.?\b|kb\.?\b)=$1$2 <kilo><byt>
(\d+)\s?(<[a-z\d]+>)?\s?(байт\.?\b|byte\.?\b)=$1$2 <byt>
#
(\d+)\s?(<[a-z\d]+>)?\s?(Тбит\.?\b|Tbit\.?\b)=$1$2 <tera><bit>
(\d+)\s?(<[a-z\d]+>)?\s?(Гбит\.?\b|Gbit\.?\b)=$1$2 <giga><bit>
(\d+)\s?(<[a-z\d]+>)?\s?(Мбит\.?\b|Mbit\.?\b)=$1$2 <mega><bit>
(\d+)\s?(<[a-z\d]+>)?\s?(Кбит\.?\b|kbit\.?\b)=$1$2 <kilo><bit>
(\d+)\s?(<[a-z\d]+>)?\s?(бит\.?\b|bit\.?\b)=$1$2 <bit>
#
(\d+)\s?(<[a-z\d]+>)?\s?(\x24|\bдолл\.?\b|\bдол\.?\b)=$1$2 <usd>
(\d+)\s?(<[a-z\d]+>)?\s?(\bцент\.?\b)=$1$2 <cnt>
(\d+)\s?(<[a-z\d]+>)?\s?(\bруб\.?\b)=$1$2 <rub>
(\d+)\s?(<[a-z\d]+>)?\s?(\bкоп\.?\b)=$1$2 <kop>
(\d+)\s?(<[a-z\d]+>)?\s?(\x88|\x{e282}|\bевр\.?\b)=$1$2 <eur>
(\d+)\s?(<[a-z\d]+>)?\s?(\x{20b4}|\bгрн\.?\b)=$1$2 <grn>
(\d+)\s?(<[a-z\d]+>)?\s?(\bевроцент\.?\b)=$1$2 <ecn>
###########################################################################################
# млрд
(\d+)\s?(\bмлрд\.|\bмлрд\b)=$1<t1><mlrd>
# млн
(\d+)\s?(\bмлн\.|\bмлн\b)=$1<t1><mln>
# тыс
(\d+)\s?(\bтыс\.|\bтыс\b)=$1<t1><tis>
#
(<t[a-z]\d>)(\s+)?(<[a-z]+>)?(\s+)?(\bтыс\b)\.?=$1<tis>$3
(<t[\d]>)(\s+)?(<[a-z]+>)?(\s+)?(\bтыс\b)\.?=$1<tis>$3
(<[a-z\d]+>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлн\b)\.?=$1<mln>$3
(<t[\d]>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлн\b)\.?=$1<mln>$3
(<t[a-z]\d>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлрд\b)\.?=$1<mlrd>$3
(<t[\d]>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлрд\b)\.?=$1<mlrd>$3
# экз
\b((\d+)?([02-9])(1)|(1))\s(\bэкз\.?\b)=$1 экземпляр
\b((\d+)?([02-9])([2-4])|([2-4]))\s(\bэкз\.?\b)=$1 экземпляра
\b(\d+)\s(\bэкз\.?\b)=$1 экземпляров
###########################################################################################
# коррекция ошибок
<sec>\s(\bполовиной\b)=с $1
(\€|\$)\s?(\d+)=$2
(\d+)\s?(\€|\$)=$1
<usd>\.?\s(\bдоллар)([а-яё]+)=<usd>
<rub>\.?\s(\bрубл)([а-яё]+)=<rub>
<grn>\.?\s(\bгрив)([а-яё]+)=<grn>
<eur>\.?\s(\bевро\b)=<eur>
(\d+)\s\-\s(\bя\b)\s([а-яё]+)(ал\b|ала\b)=$1. $2 $3$4
<t[a-z]\d>(<t\d>)=$1
<t[a-z]\d>(<t[a-z]\d>)=$1
(<tis>)\.=$1
(<mln>)\.=$1
(<mlrd>)\.=$1
###########################################################################################
# Форматирование замен
###########################################################################################
# Определение группы чисел
\b([0]?1)<t([a-z])(\d)>=<$1:$21:t$3>
\b(\d+)?([2-90])(1)<t([a-z])(\d)>=<$1$2$3:$41:t$5>
\b(\d+)?([1])([2-4])<t([a-z])(\d)>=<$1$2$3:$43:t$5>
\b(\d+)?([2-90])?([2-4])<t([a-z])(\d)>=<$1$2$3:$42:t$5>
\b(\d+)<t([a-z])(\d)>=<$1:$23:t$3>
\b([0]?1)<t(\d)>=<$1:1:t$2>
\b(\d+)?([2-90])(1)<t(\d)>=<$1$2$3:1:t$4>
\b(\d+)?([1])([2-4])<t(\d)>=<$1$2$3:3:t$4>
\b(\d+)?([2-90])?([2-4])<t(\d)>=<$1$2$3:2:t$4>
\b(\d+)<t(\d)>=<$1:3:t$2>
# группы пояснительных слов
# м.р.цел.
#<(\d+):([a-z])(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
#<(\d+):(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:a$2:t$3>$4 $5<$6:a$2:t$3>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:$2$3:t$4> $5<$6:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)?\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:$2$3:t$4> $5<$6:$2$3:t$4>
#
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:a$2:t$3>$4 $5<$6:a$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:a$2:t$3> $4<$5:a$2:t$3>
<(\d+):(\d):t(\d)>\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<$1:a$2:t$3> <$4:a$2:t$3>
# м.р.пор.
#<(\d+):([a-z])(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\byy\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\byy\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?<(\byy\b)>=<$1:$2$3:t$4> $5<$6:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?<(\byy\b)>=<$1:$2$3:t$4> <$5:$2$3:t$4>
#<(\d+):(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\byy\b)>=<$1:d$2:t$3>$4 $5<$6:d$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\byy\b)>=<$1:d$2:t$3>$4 $5<$6:d$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?<(\byy\b)>=<$1:d$2:t$3> $4<$5:d$2:t$3>
<(\d+):(\d):t(\d)>\s?<(\byy\b)>=<$1:d$2:t$3> <$4:d$2:t$3>
# ж.р.цел.
#<(\d+):([a-z])(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:$2$3:t$4> $5<$6:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:$2$3:t$4> <$5:$2$3:t$4>
#<(\d+):(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:b$2:t$3>$4 $5<$6:b$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:b$2:t$3>$4 $5<$6:b$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:b$2:t$3> $4<$5:b$2:t$3>
<(\d+):(\d):t(\d)>\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<$1:b$2:t$3> <$4:b$2:t$3>
# ж.р.пор.
#<(\d+):([a-z])(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bwek\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bwek\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?<(\bwek\b)>=<$1:$2$3:t$4> $5<$6:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?<(\bwek\b)>=<$1:$2$3:t$4> <$5:$2$3:t$4>
#<(\d+):(\d):t(\d)>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bwek\b)>=<$1:e$2:t$3>$4 $5<$6:e$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bwek\b)>=<$1:e$2:t$3>$4 $5<$6:e$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?<(\bwek\b)>=<$1:e$2:t$3> $4<$5:e$2:t$3>
<(\d+):(\d):t(\d)>\s?<(\bwek\b)>=<$1:e$2:t$3> <$4:e$2:t$3>
# с.р.пор.
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bdd\b)>=<$1:$2$3:t$4>$5 $6<$7:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?(<[a-z]+>)\s?<(\bdd\b)>=<$1:$2$3:t$4> $5<$6:$2$3:t$4>
<(\d+):([a-z])(\d):t(\d)>\s?<(\bdd\b)>=<$1:$2$3:t$4><$5:$2$3:t$4>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bdd\b)>=<$1:c$2:t$3>$4 $5<$6:c$2:t$3>
<(\d+):(\d):t(\d)>\s?(<[a-z]+>)\s?<(\bdd\b)>=<$1:c$2:t$3> $4<$5:c$2:t$3>
<(\d+):(\d):t(\d)>\s?<(\bdd\b)>=<$1:c$2:t$3><$4:c$2:t$3>
<(\d+):(\d):t(\d)><mm>=<mm:$1:t$3>
# удаление лишнего
<(\d+):(\d):t([abcd])(\d)>=<$1:$3$2:t$4>
<(\d+):(\d):t(\d)>=$1
# склонение пояснительных слов
# коррекция склонения сокр. числительных
<(\d+):([a-z])(\d):t(\d)>(\s+)?<(\bmlrd\b|\bmln\b)>=<$1:$2$3:t$4><$6:$2$3:t$4>
<(\d+):(\d):t(\d)>(\s+)?<(\bmlrd\b|\bmln\b)>=<$1:a$2:t$3><$5:a$2:t$3>
<(\d+):([a-z])(\d):t(\d)>(\s+)?<(\btis\b)>=<$1:$2$3:t$4><$6:$2$3:t$4>
<(\d+):(\d):t(\d)>(\s+)?<(\btis\b)>=<$1:b$2:t$3><$5:b$2:t$3>
#
#<(\d+):a(\d):t(\d)><tis=<$1:b$2:t$3><tis
<(\d+):b(\d):t(\d)><(\bmln\b|\bmlrd\b)=<$1:a$2:t$3><$4
(<(\bmln\b|\bmlrd\b|\btis\b):([ab])(\d+):t(\d)>)<([a-z]+):([ab])\d+:t(\d)>=$1<$6:$73:t$8>
<([0-9]?[1]):a([1]):t(\d)>(\s+)?<tis=<$1:a2:t$3><tis
<(\d+):a(\d):t(\d)>(\s+)?<tis=<$1:b$2:t$3><tis
<(\d+):d(\d):t(\d)>(\s+)?<tis=<$1:e$2:t$3><tis
(<tis:[a-z]\d:t\d>)(\s+)?<(\busd\b|\brub\b|\bgrn\b):a1:t2>=$1 <$3:a2:t2>
# проценты
<per:[a-z]1:t1>= процент 
<per:[a-z]1:t2>= процента 
<per:[a-z]1:t3>= проценту 
<per:[a-z]1:t4>= процент 
<per:[a-z]1:t5>= процентом 
<per:[a-z]1:t6>= проценте 
<per:[a-z]2:t1>= процента 
<per:[a-z]2:t2>= процентов 
<per:[a-z]2:t3>= процентам 
<per:[a-z]2:t4>= процента 
<per:[a-z]2:t5>= процентами 
<per:[a-z]2:t6>= процентах 
<per:[a-z]3:t1>= процентов 
<per:[a-z]3:t2>= процентов 
<per:[a-z]3:t3>= процентам 
<per:[a-z]3:t4>= процентов 
<per:[a-z]3:t5>= процентами 
<per:[a-z]3:t6>= процентах 
# часы
<hr:[a-z]1:t1>= час 
<hr:[a-z]1:t2>= часа 
<hr:[a-z]1:t3>= часу 
<hr:[a-z]1:t4>= час 
<hr:[a-z]1:t5>= часом 
<hr:[a-z]1:t6>= часе 
<hr:[a-z]2:t1>= часА 
<hr:[a-z]2:t2>= часов 
<hr:[a-z]2:t3>= часам 
<hr:[a-z]2:t4>= часА 
<hr:[a-z]2:t5>= часами 
<hr:[a-z]2:t6>= часах 
<hr:a3:t1>= часов 
<hr:[b-z]3:t1>= часы
<hr:[a-z]3:t2>= часов 
<hr:[a-z]3:t3>= часам 
<hr:[a-z]3:t4>= часов 
<hr:[a-z]3:t5>= часами 
<hr:[a-z]3:t6>= часах 
# месяцы
<mnth:[a-z]1:t1>= месяц 
<mnth:[a-z]1:t2>= месяца 
<mnth:[a-z]1:t3>= месяцу 
<mnth:[a-z]1:t4>= месяц 
<mnth:[a-z]1:t5>= месяцем 
<mnth:[a-z]1:t6>= месяце 
<mnth:[a-z]2:t1>= месяца 
<mnth:[a-z]2:t2>= месяцев 
<mnth:[a-z]2:t3>= месяцам 
<mnth:[a-z]2:t4>= месяца 
<mnth:[a-z]2:t5>= месяцами 
<mnth:[a-z]2:t6>= месяцах 
<mnth:[a-z]3:t1>= месяцы 
<mnth:[a-z]3:t2>= месяцев 
<mnth:[a-z]3:t3>= месяцам 
<mnth:[a-z]3:t4>= месяцов 
<mnth:[a-z]3:t5>= месяцами 
<mnth:[a-z]3:t6>= месяцах 
# неделя 
<wek:[a-z]1:t1>= неделя 
<wek:[a-z]1:t2>= недели 
<wek:[a-z]1:t3>= неделе 
<wek:[a-z]1:t4>= неделю 
<wek:[a-z]1:t5>= неделей 
<wek:[a-z]1:t6>= неделе 
<wek:[a-z]2:t1>= недели 
<wek:[a-z]2:t2>= недель 
<wek:[a-z]2:t3>= неделям 
<wek:[a-z]2:t4>= недели 
<wek:[a-z]2:t5>= неделями 
<wek:[a-z]2:t6>= неделях 
<wek:[a-z]3:t1>= недель 
<wek:[a-z]3:t2>= недель 
<wek:[a-z]3:t3>= неделям 
<wek:[a-z]3:t4>= недель 
<wek:[a-z]3:t5>= неделями 
<wek:[a-z]3:t6>= неделях 
# минуты 
<min:[a-z]1:t1>= минута 
<min:[a-z]1:t2>= минуты 
<min:[a-z]1:t3>= минуте 
<min:[a-z]1:t4>= минуту 
<min:[a-z]1:t5>= минутой 
<min:[a-z]1:t6>= минуте 
<min:[a-z]2:t1>= минуты 
<min:[a-z]2:t2>= минут 
<min:[a-z]2:t3>= минутам 
<min:[a-z]2:t4>= минуты 
<min:[a-z]2:t5>= минутами 
<min:[a-z]2:t6>= минутах 
<min:[a-z]3:t1>= минут 
<min:[a-z]3:t2>= минут 
<min:[a-z]3:t3>= минутам 
<min:[a-z]3:t4>= минут 
<min:[a-z]3:t5>= минутами 
<min:[a-z]3:t6>= минутах 
# тысяча 
<tis:[a-z]1:t1>= тысяча 
<tis:[a-z]1:t2>= тысячи 
<tis:[a-z]1:t3>= тысяче 
<tis:[a-z]1:t4>= тысячу 
<tis:[a-z]1:t5>= тысячей 
<tis:[a-z]1:t6>= тысяче 
<tis:[a-z]2:t1>= тысячи 
<tis:[a-z]2:t2>= тысяч 
<tis:[a-z]2:t3>= тысячам 
<tis:[a-z]2:t4>= тысячи 
<tis:[a-z]2:t5>= тысячами 
<tis:[a-z]2:t6>= тысячах 
<tis:[a-z]3:t1>= тысяч 
<tis:[a-z]3:t2>= тысяч 
<tis:[a-z]3:t3>= тысячам 
<tis:[a-z]3:t4>= тысяч 
<tis:[a-z]3:t5>= тысячами 
<tis:[a-z]3:t6>= тысячах 
# миллион
<mln:[a-z]1:t1>= миллион 
<mln:[a-z]1:t2>= миллиона 
<mln:[a-z]1:t3>= миллиону 
<mln:[a-z]1:t4>= миллион 
<mln:[a-z]1:t5>= миллионом 
<mln:[a-z]1:t6>= миллионе 
<mln:[a-z]2:t1>= миллиона 
<mln:[a-z]2:t2>= миллионов 
<mln:[a-z]2:t3>= миллионам 
<mln:[a-z]2:t4>= миллиона 
<mln:[a-z]2:t5>= миллионами 
<mln:[a-z]2:t6>= миллионах 
<mln:[a-z]3:t1>= миллионов 
<mln:[a-z]3:t2>= миллионов 
<mln:[a-z]3:t3>= миллионам 
<mln:[a-z]3:t4>= миллионов 
<mln:[a-z]3:t5>= миллионами 
<mln:[a-z]3:t6>= миллионах 
# миллиард
<mlrd:[a-z]1:t1>= миллиард 
<mlrd:[a-z]1:t2>= миллиарда 
<mlrd:[a-z]1:t3>= миллиарду 
<mlrd:[a-z]1:t4>= миллиард 
<mlrd:[a-z]1:t5>= миллиардом 
<mlrd:[a-z]1:t6>= миллиарде 
<mlrd:[a-z]2:t1>= миллиарда 
<mlrd:[a-z]2:t2>= миллиардов 
<mlrd:[a-z]2:t3>= миллиардам 
<mlrd:[a-z]2:t4>= миллиарда 
<mlrd:[a-z]2:t5>= миллиардами 
<mlrd:[a-z]2:t6>= миллиардах 
<mlrd:[a-z]3:t1>= миллиардов 
<mlrd:[a-z]3:t2>= миллиардов 
<mlrd:[a-z]3:t3>= миллиардам 
<mlrd:[a-z]3:t4>= миллиардов 
<mlrd:[a-z]3:t5>= миллиардами 
<mlrd:[a-z]3:t6>= миллиардах 
# секунды 
<sec:[a-z]1:t1>= секунда 
<sec:[a-z]1:t2>= секунды 
<sec:[a-z]1:t3>= секунде 
<sec:[a-z]1:t4>= секунду 
<sec:[a-z]1:t5>= секундой 
<sec:[a-z]1:t6>= секунде 
<sec:[a-z]2:t1>= секунды 
<sec:[a-z]2:t2>= секунд 
<sec:[a-z]2:t3>= секундам 
<sec:[a-z]2:t4>= секунды 
<sec:[a-z]2:t5>= секундами 
<sec:[a-z]2:t6>= секундах 
<sec:[a-z]3:t1>= секунд 
<sec:[a-z]3:t2>= секунд 
<sec:[a-z]3:t3>= секундам 
<sec:[a-z]3:t4>= секунд 
<sec:[a-z]3:t5>= секундами 
<sec:[a-z]3:t6>= секундах 
# число
<dd:c(\d):t(\d)>=
# месяцы
<mm:12:t1>=декабрь
<mm:12:t2>=декабря
<mm:12:t3>=декабрю
<mm:12:t4>=декабрь
<mm:12:t5>=декабрем
<mm:12:t6>=декабре
<mm:11:t1>=ноябрь
<mm:11:t2>=ноября
<mm:11:t3>=ноябрю
<mm:11:t4>=ноябрь
<mm:11:t5>=ноябрем
<mm:11:t6>=ноябре
<mm:10:t1>=октябрь
<mm:10:t2>=октября
<mm:10:t3>=октябрю
<mm:10:t4>=октябрь
<mm:10:t5>=октябрем
<mm:10:t6>=октябре
<mm:0?9:t1>=сентябрь
<mm:0?9:t2>=сентября
<mm:0?9:t3>=сентябрю
<mm:0?9:t4>=сентябрь
<mm:0?9:t5>=сентябрем
<mm:0?9:t6>=сентябре
<mm:0?8:t1>=август
<mm:0?8:t2>=августа
<mm:0?8:t3>=августу
<mm:0?8:t4>=август
<mm:0?8:t5>=августом
<mm:0?8:t6>=августе
<mm:0?7:t1>=июль
<mm:0?7:t2>=июля
<mm:0?7:t3>=июлю
<mm:0?7:t4>=июль
<mm:0?7:t5>=июлем
<mm:0?7:t6>=июле
<mm:0?6:t1>=июнь
<mm:0?6:t2>=июня
<mm:0?6:t3>=июню
<mm:0?6:t4>=июнь
<mm:0?6:t5>=июнем
<mm:0?6:t6>=июне
<mm:0?5:t1>=май
<mm:0?5:t2>=мая
<mm:0?5:t3>=маю
<mm:0?5:t4>=май
<mm:0?5:t5>=маем
<mm:0?5:t6>=мае
<mm:0?4:t1>=апрель
<mm:0?4:t2>=апреля
<mm:0?4:t3>=апрелю
<mm:0?4:t4>=апрель
<mm:0?4:t5>=апрелем
<mm:0?4:t6>=апреле
<mm:0?3:t1>=март
<mm:0?3:t2>=марта
<mm:0?3:t3>=мару
<mm:0?3:t4>=март
<mm:0?3:t5>=мартом
<mm:0?3:t6>=марте
<mm:0?2:t1>=февраль
<mm:0?2:t2>=февраля
<mm:0?2:t3>=февралю
<mm:0?2:t4>=февраль
<mm:0?2:t5>=февралем
<mm:0?2:t6>=феврале
<mm:0?1:t1>=январь
<mm:0?1:t2>=января
<mm:0?1:t3>=январю
<mm:0?1:t4>=январь
<mm:0?1:t5>=январем
<mm:0?1:t6>=январе
# года
#<([01]?[0-9]):d(\d):t(\d)><yy:d(\d):t(\d)>=<20$1:d$2:t$3><yy:d$4:t$5>
#<([2-9]?[0-9]):d(\d):t(\d)><yy:d(\d):t(\d)>=<19$1:d$2:t$3><yy:d$4:t$5>
<yy:[a-z](\d):t1>= год 
<yy:[a-z](\d):t2>= года 
<yy:[a-z](\d):t3>= году 
<yy:[a-z](\d):t4>= год 
<yy:[a-z](\d):t5>= годом  
<yy:[a-z](\d):t6>= годУ 
# метры
<mt:[a-z]1:t1>= метр 
<mt:[a-z]1:t2>= метра 
<mt:[a-z]1:t3>= метру 
<mt:[a-z]1:t4>= метр 
<mt:[a-z]1:t5>= метром  
<mt:[a-z]1:t6>= метре 
<mt:[a-z]2:t1>= метра 
<mt:[a-z]2:t2>= метров 
<mt:[a-z]2:t3>= метрам 
<mt:[a-z]2:t4>= метра 
<mt:[a-z]2:t5>= метрами 
<mt:[a-z]2:t6>= метрах 
<mt:[a-z]3:t1>= метров 
<mt:[a-z]3:t2>= метров 
<mt:[a-z]3:t3>= метрам 
<mt:[a-z]3:t4>= метров 
<mt:[a-z]3:t5>= метрами 
<mt:[a-z]3:t6>= метрах 
# градусы
<gra:[a-z]1:t1>= градус 
<gra:[a-z]1:t2>= градуса 
<gra:[a-z]1:t3>= градусу 
<gra:[a-z]1:t4>= градус 
<gra:[a-z]1:t5>= градусом  
<gra:[a-z]1:t6>= градусе 
<gra:[a-z]2:t1>= градуса 
<gra:[a-z]2:t2>= градусов 
<gra:[a-z]2:t3>= градусам 
<gra:[a-z]2:t4>= градуса 
<gra:[a-z]2:t5>= градусами 
<gra:[a-z]2:t6>= градусах 
<gra:[a-z]3:t1>= градусов 
<gra:[a-z]3:t2>= градусов 
<gra:[a-z]3:t3>= градусам 
<gra:[a-z]3:t4>= градусов 
<gra:[a-z]3:t5>= градусами 
<gra:[a-z]3:t6>= градусах 
# граммы
<gr:[a-z]1:t1>= грамм 
<gr:[a-z]1:t2>= грамма 
<gr:[a-z]1:t3>= грамму 
<gr:[a-z]1:t4>= грамм 
<gr:[a-z]1:t5>= граммом  
<gr:[a-z]1:t6>= грамме 
<gr:[a-z]2:t1>= грамма 
<gr:[a-z]2:t2>= граммов 
<gr:[a-z]2:t3>= граммам 
<gr:[a-z]2:t4>= грамма 
<gr:[a-z]2:t5>= граммами 
<gr:[a-z]2:t6>= граммах 
<gr:[a-z]3:t1>= граммов 
<gr:[a-z]3:t2>= граммов 
<gr:[a-z]3:t3>= граммам 
<gr:[a-z]3:t4>= граммов 
<gr:[a-z]3:t5>= граммами 
<gr:[a-z]3:t6>= граммах 
# тонны
<tn:[a-z]1:t1>= тонна 
<tn:[a-z]1:t2>= тонны 
<tn:[a-z]1:t3>= тонне 
<tn:[a-z]1:t4>= тонну 
<tn:[a-z]1:t5>= тонной 
<tn:[a-z]1:t6>= тонне 
<tn:[a-z]2:t1>= тонны 
<tn:[a-z]2:t2>= тонн 
<tn:[a-z]2:t3>= тоннам 
<tn:[a-z]2:t4>= тонны 
<tn:[a-z]2:t5>= тоннами  
<tn:[a-z]2:t6>= тоннах 
<tn:[a-z]3:t1>= тонн 
<tn:[a-z]3:t2>= тонн 
<tn:[a-z]3:t3>= тоннам  
<tn:[a-z]3:t4>= тонны 
<tn:[a-z]3:t5>= тоннами  
<tn:[a-z]3:t6>= тоннах 
# гривна
<grn:[a-z]1:t1>= гривна 
<grn:[a-z]1:t2>= гривны 
<grn:[a-z]1:t3>= гривне 
<grn:[a-z]1:t4>= гривну 
<grn:[a-z]1:t5>= гривной 
<grn:[a-z]1:t6>= гривне 
<grn:[a-z]2:t1>= гривны 
<grn:[a-z]2:t2>= гривен 
<grn:[a-z]2:t3>= гривнам 
<grn:[a-z]2:t4>= гривны 
<grn:[a-z]2:t5>= гривнами  
<grn:[a-z]2:t6>= гривнах 
<grn:[a-z]3:t1>= гривен 
<grn:[a-z]3:t2>= гривен 
<grn:[a-z]3:t3>= гривнам  
<grn:[a-z]3:t4>= гривны 
<grn:[a-z]3:t5>= гривнами  
<grn:[a-z]3:t6>= гривнах 
# литры
<lt:[a-z]1:t1>= литр 
<lt:[a-z]1:t2>= литра 
<lt:[a-z]1:t3>= литру 
<lt:[a-z]1:t4>= литр 
<lt:[a-z]1:t5>= литром 
<lt:[a-z]1:t6>= литре 
<lt:[a-z]2:t1>= литра 
<lt:[a-z]2:t2>= литров 
<lt:[a-z]2:t3>= литрам 
<lt:[a-z]2:t4>= литра 
<lt:[a-z]2:t5>= литрами 
<lt:[a-z]2:t6>= литрах 
<lt:[a-z]3:t1>= литров 
<lt:[a-z]3:t2>= литров 
<lt:[a-z]3:t3>= литрам 
<lt:[a-z]3:t4>= литров 
<lt:[a-z]3:t5>= литрами 
<lt:[a-z]3:t6>= литрах 
# доллары
<usd:[a-z]1:t1>= доллар 
<usd:[a-z]1:t2>= доллара 
<usd:[a-z]1:t3>= доллару 
<usd:[a-z]1:t4>= доллар 
<usd:[a-z]1:t5>= долларом 
<usd:[a-z]1:t6>= долларе 
<usd:[a-z]2:t1>= доллара 
<usd:[a-z]2:t2>= долларов 
<usd:[a-z]2:t3>= долларам 
<usd:[a-z]2:t4>= доллара 
<usd:[a-z]2:t5>= долларами 
<usd:[a-z]2:t6>= долларах 
<usd:[a-z]3:t1>= долларов 
<usd:[a-z]3:t2>= долларов 
<usd:[a-z]3:t3>= долларам 
<usd:[a-z]3:t4>= долларов 
<usd:[a-z]3:t5>= долларами 
<usd:[a-z]3:t6>= долларах 
# центы
<cnt:[a-z]1:t1>= цент 
<cnt:[a-z]1:t2>= цента 
<cnt:[a-z]1:t3>= центу 
<cnt:[a-z]1:t4>= цент 
<cnt:[a-z]1:t5>= центом 
<cnt:[a-z]1:t6>= центе 
<cnt:[a-z]2:t1>= цента 
<cnt:[a-z]2:t2>= центов 
<cnt:[a-z]2:t3>= центам 
<cnt:[a-z]2:t4>= цента 
<cnt:[a-z]2:t5>= центами 
<cnt:[a-z]2:t6>= центах 
<cnt:[a-z]3:t1>= центов 
<cnt:[a-z]3:t2>= центов 
<cnt:[a-z]3:t3>= центам 
<cnt:[a-z]3:t4>= центов 
<cnt:[a-z]3:t5>= центами 
<cnt:[a-z]3:t6>= центах 
# рубли
<rub:[a-z]1:t1>= рубль  
<rub:[a-z]1:t2>= рубля 
<rub:[a-z]1:t3>= рублю 
<rub:[a-z]1:t4>= рубль 
<rub:[a-z]1:t5>= рублем 
<rub:[a-z]1:t6>= рубле 
<rub:[a-z]2:t1>= рубля 
<rub:[a-z]2:t2>= рублей 
<rub:[a-z]2:t3>= рублям 
<rub:[a-z]2:t4>= рубля 
<rub:[a-z]2:t5>= рублями 
<rub:[a-z]2:t6>= рублях 
<rub:[a-z]3:t1>= рублей 
<rub:[a-z]3:t2>= рублей 
<rub:[a-z]3:t3>= рублям 
<rub:[a-z]3:t4>= рублей 
<rub:[a-z]3:t5>= рублями 
<rub:[a-z]3:t6>= рублях 
# копейки
<kop:[a-z]1:t1>= копейка 
<kop:[a-z]1:t2>= копейки 
<kop:[a-z]1:t3>= копейке 
<kop:[a-z]1:t4>= копейку 
<kop:[a-z]1:t5>= копейкой 
<kop:[a-z]1:t6>= копейке 
<kop:[a-z]2:t1>= копейки 
<kop:[a-z]2:t2>= копеек 
<kop:[a-z]2:t3>= копейкам 
<kop:[a-z]2:t4>= копейки 
<kop:[a-z]2:t5>= копейками  
<kop:[a-z]2:t6>= копейках 
<kop:[a-z]3:t1>= копеек 
<kop:[a-z]3:t2>= копеек 
<kop:[a-z]3:t3>= копейкам  
<kop:[a-z]3:t4>= копейки 
<kop:[a-z]3:t5>= копейками  
<kop:[a-z]3:t6>= копейках 
# евро
<eur:[a-z](\d):t(\d)>= евро 
# евроценты
<ecn:[a-z]1:t1>= евроцент 
<ecn:[a-z]1:t2>= евроцента 
<ecn:[a-z]1:t3>= евроценту 
<ecn:[a-z]1:t4>= евроцент 
<ecn:[a-z]1:t5>= евроцентом 
<ecn:[a-z]1:t6>= евроценте 
<ecn:[a-z]2:t1>= евроцента 
<ecn:[a-z]2:t2>= евроцентов 
<ecn:[a-z]2:t3>= евроцентам 
<ecn:[a-z]2:t4>= евроцента 
<ecn:[a-z]2:t5>= евроцентами 
<ecn:[a-z]2:t6>= евроцентах 
<ecn:[a-z]3:t1>= евроцентов 
<ecn:[a-z]3:t2>= евроцентов 
<ecn:[a-z]3:t3>= евроцентам 
<ecn:[a-z]3:t4>= евроцентов 
<ecn:[a-z]3:t5>= евроцентами 
<ecn:[a-z]3:t6>= евроцентах 
# байт
<byt:[a-z]1:t1>= байт 
<byt:[a-z]1:t2>= байта 
<byt:[a-z]1:t3>= байту 
<byt:[a-z]1:t4>= байт 
<byt:[a-z]1:t5>= байтом 
<byt:[a-z]1:t6>= байте 
<byt:[a-z]2:t1>= байта 
<byt:[a-z]2:t2>= байтов 
<byt:[a-z]2:t3>= байтам 
<byt:[a-z]2:t4>= байта 
<byt:[a-z]2:t5>= байтами 
<byt:[a-z]2:t6>= байтах 
<byt:[a-z]3:t1>= байтов 
<byt:[a-z]3:t2>= байтов 
<byt:[a-z]3:t3>= байтам 
<byt:[a-z]3:t4>= байтов 
<byt:[a-z]3:t5>= байтами 
<byt:[a-z]3:t6>= байтах 
# бит
<bit:[a-z]1:t1>= бит 
<bit:[a-z]1:t2>= бита 
<bit:[a-z]1:t3>= биту 
<bit:[a-z]1:t4>= бит 
<bit:[a-z]1:t5>= битом 
<bit:[a-z]1:t6>= бите 
<bit:[a-z]2:t1>= бита 
<bit:[a-z]2:t2>= битов 
<bit:[a-z]2:t3>= битам 
<bit:[a-z]2:t4>= бита 
<bit:[a-z]2:t5>= битами 
<bit:[a-z]2:t6>= битах 
<bit:[a-z]3:t1>= битов 
<bit:[a-z]3:t2>= битов 
<bit:[a-z]3:t3>= битам 
<bit:[a-z]3:t4>= битов 
<bit:[a-z]3:t5>= битами 
<bit:[a-z]3:t6>= битах 
#порядки
<kilo>\s*= кило
<santi>\s*= санти
<mili>\s*= милли
<tera>\s*= тера
<giga>\s*= гига
<mega>\s*= мега
<micro>\s*= микро
########################################################################################
# склонение групп чисел
<(\d+):0:t(\d)>=
# од.м.р.ц.
<(\d+):j(\d):t4>=<$1:a$2:t2>
<(\d+):j(\d):t(\d)>=<$1:a$2:t$3>
# од.м.р.п.
<(\d+):k(\d):t4>=<$1:d$2:t2>
<(\d+):k(\d):t(\d)>=<$1:d$2:t$3>
# од.ж.р.ц.
<(\d+):l(\d):t4>=<$1:b$2:t2>
<(\d+):l(\d):t(\d)>=<$1:b$2:t$3>
# од.ж.р.п.
<(\d+):m(\d):t4>=<$1:e$2:t2>
<(\d+):m(\d):t(\d)>=<$1:e$2:t$3>
# од.мн.ц.
<(\d+):n(\d):t4>=<$1:g$2:t2>
<(\d+):n(\d):t(\d)>=<$1:g$2:t$3>
# од.мн.п.
<(\d+):o(\d):t4>=<$1:f$2:t2>
<(\d+):o(\d):t(\d)>=<$1:f$2:t$3>
# м.р.цел
<(\d+):a(\d):t1>=$1
<(\d+):a(\d):t2>=$1-го
<(\d+):a(\d):t3>=$1-му
<(\d+):a(\d):t4>=$1
<(\d+):a(\d):t5>=$1-им
<(\d+):a(\d):t6>=$1-ом
# м.р.пор.
<(\d+):d(\d):t1>=$1-ый
<(\d+):d(\d):t2>=$1-ого
<(\d+):d(\d):t3>=$1-ому
<(\d+):d(\d):t4>=$1-ый
<(\d+):d(\d):t5>=$1-ым
<(\d+):d(\d):t6>=$1-м
# ж.р.цел ед.чис.
<(\d+):b(\d):t1>=$1-а
<(\d+):b(\d):t2>=$1-ой
<(\d+):b(\d):t3>=$1-ой
<(\d+):b(\d):t4>=$1-у
<(\d+):b(\d):t5>=$1-ой
<(\d+):b(\d):t6>=$1-ой
#<(\d+):b2:t1>=$1-а
#<(\d+):b2:t2>=$1-ой
#<(\d+):b2:t3>=$1-му
#<(\d+):b2:t4>=$1-а
#<(\d+):b2:t5>=$1-ою
#<(\d+):b2:t6>=$1-ой
#<(\d+):b3:t1>=$1-а
#<(\d+):b3:t2>=$1-ой
#<(\d+):b3:t3>=$1-му
#<(\d+):b3:t4>=$1-а
#<(\d+):b3:t5>=$1-ою
#<(\d+):b3:t6>=$1-ой
# ж.р.пор.
<(\d+):e(\d):t1>=$1-я
<(\d+):e(\d):t2>=$1-й
<(\d+):e(\d):t3>=$1-й
<(\d+):e(\d):t4>=$1-ю
<(\d+):e(\d):t5>=$1-й
<(\d+):e(\d):t6>=$1-й
# с.р.пор.
<(\d+):c(\d):t1>=$1-е
<(\d+):c(\d):t2>=$1-ого
<(\d+):c(\d):t3>=$1-ому
<(\d+):c(\d):t4>=$1-е
<(\d+):c(\d):t5>=$1-ым
<(\d+):c(\d):t6>=$1-м
# с.р.цел.
<(\d+):h(\d):t1>=$1-о
<(\d+):h(\d):t2>=$1-го
<(\d+):h(\d):t3>=$1-му
<(\d+):h(\d):t4>=$1-о
<(\d+):h(\d):t5>=$1-им
<(\d+):h(\d):t6>=$1-ом
# мн.пор.
<(\d+):f(\d):t1>=$1-ые
<(\d+):f(\d):t2>=$1-х
<(\d+):f(\d):t3>=$1-ым
<(\d+):f(\d):t4>=$1-ые
<(\d+):f(\d):t5>=$1-ми
<(\d+):f(\d):t6>=$1-х
# мн.цел.
<(\d+):g(\d):t1>=$1-и
<(\d+):g(\d):t2>=$1-их
<(\d+):g(\d):t3>=$1-их
<(\d+):g(\d):t4>=$1-и
<(\d+):g(\d):t5>=$1-ими
<(\d+):g(\d):t6>=$1-их
# соб.
<(\d+):p(\d):t1>=$1-ро
<(\d+):p(\d):t2>=$1-ых
<(\d+):p(\d):t3>=$1-рым
<(\d+):p(\d):t4>=$1-ро
<(\d+):p(\d):t5>=$1-ыми
<(\d+):p(\d):t6>=$1-ах
# од.соб.
<(\d+):q(\d):t4>=<$1:p$2:t2>
<(\d+):q(\d):t(\d)>=<$1:p$2:t$3>
#
<(\d+):([a-z]+)(\d):t(\d)>=$1
###########################################################################################
# Сокращения
###########################################################################################
\bс\b\s\bкон\.=с конца
\bт\.\s?\bп\.=томУ подобное.
\bт\.\s?\bд\.=так далее.
\bт\.\s?\bн\.=так называемый
\bв\b\s\bт\.\s?\bч\.=в том числе
\bн\.\s?\bэ\.=нашей эры.
\bсм\.\s\bтакже\b=смотри также
\bб\b\/\bу\b=бывший в употреблении
\bед\.\s\bчисло\b=единственное число
\bмн\.\s\bчисло\b=множественное число
\bизд\.=издание
###########################################################################################
# Цифровые окончания (начало)
###########################################################################################
#
\b[0]\-\bго\b=ноль
#\b[0]\-\bго\b=ноля
\b[0]\-\bму\b=нолю
\b[0]\-\bим\b=нолём
\b[0]\-\bом\b=ноле
\b[0]\-\bа\b=ноль
\b[0]\-\bой\b=ноля
\b[0]\-\bу\b=ноль
\b[0]\-\bою\b=нолём
\b[0]\-\bо\b=ноль
\b[0]\-\bими\b=нолями
\b[0]\-\bих\b=нолях
\b[0]\-\bи\b=ноль
#
\b[0]\-\bый\b=нулевой
\b[0]\-\bого\b=нулевого
\b[0]\-\bому\b=нулевому
\b[0]\-\bым\b=нулевым
\b[0]\-\bм\b=нулевом
\b[0]\-\bя\b=нулевая
\b[0]\-\bй\b=нулевой
\b[0]\-\bю\b=нулевую
\b[0]\-\bе\b=нулевое
\b[0]\-\bх\b=нулевых
\b[0]\-\bые\b=нулевые
\b[0]\-\bми\b=нулевыми
# Количественные числительные
@\b(\d)(\d)(\d)(\d)\s?\-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.3.$1.$5> <10.2.$2.$5> <10.1.$3.$5> <10.0.$4.$5> <скл.цел.числ.кон.>
@\b(\d)(\d)(\d)\s?\-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.2.$1.$4> <10.1.$2.$4> <10.0.$3.$4> <скл.цел.числ.кон.>
@\b(\d)(\d)\s?\-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.1.$1.$3> <10.0.$2.$3> <скл.цел.числ.кон.>
@\b(\d)\s?\-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.0.$1.$2> <скл.цел.числ.кон.>
# Порядковые числительные
@\b(\d)(\d)(\d)(\d)\s?\-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.3.$1.> <10.2.$2.> <10.1.$3.> <10.0.$4.$5> <скл.пор.числ.кон.>
@\b(\d)(\d)(\d)\s?\-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.2.$1.> <10.1.$2.> <10.0.$3.$4> <скл.пор.числ.кон.>
@\b(\d)(\d)\s?\-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.1.$1.> <10.0.$2.$3> <скл.пор.числ.кон.>
@\b(\d)\s?\-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.0.$1.$2> <скл.пор.числ.кон.>
# Cобирательные числительные
@\b(2|3)(0)\s?\-\s?(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=<скл.соб.числ.нач.> <10.1.$1.$3> <10.0.$2.$3> <скл.соб.числ.кон.>
@\b(1)([0-9])\s?\-\s?(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=<скл.соб.числ.нач.> <10.1.$1.$3> <10.0.$2.$3> <скл.соб.числ.кон.>
@\b([2-9])\s?\-\s?(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=<скл.соб.числ.нач.> <10.0.$1.$2> <скл.соб.числ.кон.>
# Коррекция ноля для порядковых числительных
<10\.1\.([0-9])\.>\s<10\.0\.0\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.1.$1.$2> <02.$2>
<10\.2\.([0-9])\.>\s<10\.1\.0\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.2.$1.$2> <02.$2>
<10\.3\.([0-9])\.>\s<10\.2\.0\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.3.$1.$2> <02.$2>
# Коррекция ноля для количественных числительных
<10\.1\.([0-9])\.([а-яё]{1,3})>\s<10\.0\.0\.([а-яё]{1,3})>=<10.1.$1.0> <0.$3>
<10\.2\.([0-9])\.([а-яё]{1,3})>\s<10\.1\.0\.0\>\s<0\.([а-яё]{1,3})>=<10.2.$1.$2> <0.$3>
<10\.3\.([0-9])\.([а-яё]{1,3})>\s<10\.2\.0\.0\>\s<0\.([а-яё]{1,3})>=<10.3.$1.$2> <0.$3>
<10\.([0-9])\.([0-9])\.0\>\s<0\.([а-яё]{1,3})>=<10.$1.$2.$3>
<0\.([а-яё]{1,3})?>=
<02\.([а-яё]{1,3})?>=
#
<10\.0\.0\.([а-яё]{1,3})?>\s<10\.(\d+)\.(\d+)\.([а-яё]{1,3})?>=<10.$2.$3.$4>
<10\.([1-9])\.([2-9])\.([а-яё]{1,3})?>\s<10\.0\.0\.>=<10.$1.$2.$3>

# Коррекция степеней
##########################################################################################

<скл\.([а-яё]+)\.числ\.нач\.>\s+<10\.3\.1\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>\s+<скл\.пор\.числ\.кон\.>=<10.3.1.$2>
<скл\.([а-яё]+)\.числ\.нач\.>\s+<10\.3\.([2-9])\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>\s+<скл\.пор\.числ\.кон\.>=<10.0.$2.го> <10.3.1.$3>

<скл\.([а-яё]+)\.числ\.нач\.>\s+<10\.3\.1\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.0.1.а> <10.3.1.а>
<10\.3\.([2-4])\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.0.$1.а> <10.3.1.ой>
<10\.3\.([5-9])\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.0.$1.а> <10.3.1.>

<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bго\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bму\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bим\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ом>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bом\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bа\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bой\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bо\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bими\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ою>
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bи\b)>((\s(<10\.(\d+)\.0\.([а-яё]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>
((<10\.(\d+)\.0\.([а-яё]{1,3})?>\s){3,999})<10\.3\.1\.([а-яё]{1,3})?>=
<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)>=<10.0.1.$1> <10.3.1.$1>

<скл\.цел\.числ\.нач\.>\s+<10\.3\.([2-9])\.(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)>=<10.0.$1.$2> <10.3.1.$2>

#---------
<10\.0\.1\.(\bго\b)>\s+<10\.3\.1\.(\bго\b)>=<10.3.1.ой>
<10\.0\.(\d+)\.(\bго\b)>\s+<10\.3\.1\.(\bго\b)>=<10.0.$1.$2> <10.3.1.>

<10\.0\.1\.(\bму\b)>\s+<10\.3\.1\.(\bму\b)>=<10.3.1.ой>
<10\.0\.(\d+)\.(\bму\b)>\s+<10\.3\.1\.(\bму\b)>=<10.0.$1.$2> <10.3.1.$3>

<10\.0\.1\.(\bим\b)>\s+<10\.3\.1\.(\bим\b)>=<10.3.1.ом>
<10\.0\.([2-9])\.(\bим\b)>\s+<10\.3\.1\.(\bим\b)>=<10.0.$1.$2> <10.3.1.ими>

<10\.0\.1\.(\bом\b)>\s+<10\.3\.1\.(\bом\b)>=<10.3.1.ой>
<10\.0\.([2-9])\.(\bом\b)>\s+<10\.3\.1\.(\bом\b)>=<10.0.$1.$2> <10.3.1.ах>

<10\.0\.1\.(\bа\b)>\s+<10\.3\.1\.(\bа\b)>=<10.3.1.$2>
<10\.0\.([2-9])\.(\bа\b)>\s+<10\.3\.1\.(\bа\b)>=<10.0.$1.$2> <10.3.1.>

<10\.0\.1\.(\bой\b)>\s+<10\.3\.1\.(\bой\b)>=<10.3.1.$2>
<10\.0\.([2-9])\.(\bой\b)>\s+<10\.3\.1\.(\bой\b)>=<10.0.$1.$2> <10.3.1.му>

<10\.0\.1\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.3.1.$2>
<10\.0\.([2-4])\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.0.$1.$2> <10.3.1.ой>
<10\.0\.([5-9])\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.0.$1.$2> <10.3.1.>

<10\.0\.1\.(\bою\b)>\s+<10\.3\.1\.(\bою\b)>=<10.3.1.$2>
<10\.0\.([2-9])\.(\bою\b)>\s+<10\.3\.1\.(\bою\b)>=<10.0.$1.$2> <10.3.1.ими>

<10\.0\.1\.(\bо\b)>\s+<10\.3\.1\.(\bо\b)>=<10.3.1.ой>
<10\.0\.([2-9])\.(\bо\b)>\s+<10\.3\.1\.(\bо\b)>=<10.0.$1.а> <10.3.1.>

<10\.0\.1\.(\bими\b)>\s+<10\.3\.1\.(\bими\b)>=<10.3.1.ою>
<10\.0\.([2-9])\.(\bими\b)>\s+<10\.3\.1\.(\bими\b)>=<10.0.$1.$2> <10.3.1.$3>

<10\.0\.1\.(\bих\b)>\s+<10\.3\.1\.(\bих\b)>=<10.3.1.ой>
<10\.0\.([2-9])\.(\bих\b)>\s+<10\.3\.1\.(\bих\b)>=<10.0.$1.$2> <10.3.1.>

<10\.0\.1\.(\bи\b)>\s+<10\.3\.1\.(\bи\b)>=<10.3.1.ой>
<10\.0\.([2-9])\.(\bи\b)>\s+<10\.3\.1\.(\bи\b)>=<10.0.$1.а> <10.3.1.ах>
#-----
<10\.([1-2])\.([4-9])\.(\bро\b)>\s+<10\.0\.(\d+)\.(\bро\b)>=<10.$1.$2.> <10.0.$4.>
<10\.([1-2])\.([4-9])\.(\bых\b)>\s+<10\.0\.(\d+)\.(\bых\b)>=<10.$1.$2.го> <10.0.$4.го>
<10\.([1-2])\.([4-9])\.(\bым\b)>\s+<10\.0\.(\d+)\.(\bым\b)>=<10.$1.$2.му> <10.0.$4.му>
<10\.([1-2])\.([4-9])\.(\bыми\b)>\s+<10\.0\.(\d+)\.(\bыми\b)>=<10.$1.$2.им> <10.0.$4.им>
<10\.([1-2])\.([4-9])\.(\bыми\b)>\s+<10\.0\.(\d+)\.(\bыми\b)>=<10.$1.$2.ом> <10.0.$4.ом>

<10\.1\.(\d+)\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>\s+<10\.0\.(\d+)\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>=<10.1.$1.> <10.0.$3.$4>
<10\.1\.1\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>\s+<10\.0\.(\d+)\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>=<10.1.1.> <10.0.$2.$3>
##########################################################################################
(<10\.(\d+)\.0\.([а-яё]{1,3})?>)+=
<10\.([1-9])\.([2-9])\.([а-яё]{1,3})?>\s<10\.0\.0\.>=<10.$1.$2.$3>
##########################################################################################
# коррекция для двух- трех- ... -тысячного
(<10\.0\.\d+\.\bго\b>)\s+(<10\.3\.1\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)>)=$1$2
# Замена чисел словами
<10\.1\.1\.>\s<10\.0\.0\.>=десять
<10\.1\.1\.>\s<10\.0\.1\.>=одиннадцать
<10\.1\.1\.>\s<10\.0\.2\.>=двенадцать
<10\.1\.1\.>\s<10\.0\.3\.>=тринадцать
<10\.1\.1\.>\s<10\.0\.4\.>=четырнадцать
<10\.1\.1\.>\s<10\.0\.5\.>=пятнадцать
<10\.1\.1\.>\s<10\.0\.6\.>=шестнадцать
<10\.1\.1\.>\s<10\.0\.7\.>=семнадцать
<10\.1\.1\.>\s<10\.0\.8\.>=восемнадцать
<10\.1\.1\.>\s<10\.0\.9\.>=девятнадцать
<10\.1\.1\.\bа\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десять
<10\.1\.1\.\bа\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцать
<10\.1\.1\.\bа\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцать
<10\.1\.1\.\bа\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцать
<10\.1\.1\.\bа\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцать
<10\.1\.1\.\bа\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцать
<10\.1\.1\.\bа\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцать
<10\.1\.1\.\bа\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцать
<10\.1\.1\.\bа\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцать
<10\.1\.1\.\bа\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцать
<10\.1\.1\.\bго\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десяти
<10\.1\.1\.\bго\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцати
<10\.1\.1\.\bго\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцати
<10\.1\.1\.\bго\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцати
<10\.1\.1\.\bго\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцати
<10\.1\.1\.\bго\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцати
<10\.1\.1\.\bго\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцати
<10\.1\.1\.\bго\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцати
<10\.1\.1\.\bго\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцати
<10\.1\.1\.\bго\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцати
<10\.1\.1\.\bе\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятое
<10\.1\.1\.\bе\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатое
<10\.1\.1\.\bе\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатое
<10\.1\.1\.\bи\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десять
<10\.1\.1\.\bи\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцать
<10\.1\.1\.\bи\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцать
<10\.1\.1\.\bи\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцать
<10\.1\.1\.\bи\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцать
<10\.1\.1\.\bи\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцать
<10\.1\.1\.\bи\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцать
<10\.1\.1\.\bи\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцать
<10\.1\.1\.\bи\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцать
<10\.1\.1\.\bи\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцать
<10\.1\.1\.\bим\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятью
<10\.1\.1\.\bим\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатью
<10\.1\.1\.\bим\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятью
<10\.1\.1\.\bими\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатью
<10\.1\.1\.\bими\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатью
<10\.1\.1\.\bих\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десяти
<10\.1\.1\.\bих\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцати
<10\.1\.1\.\bих\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцати
<10\.1\.1\.\bих\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцати
<10\.1\.1\.\bих\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцати
<10\.1\.1\.\bих\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцати
<10\.1\.1\.\bих\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцати
<10\.1\.1\.\bих\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцати
<10\.1\.1\.\bих\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцати
<10\.1\.1\.\bих\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцати
<10\.1\.1\.\bй\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятой
<10\.1\.1\.\bый\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятый
<10\.1\.1\.\bй\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатый
<10\.1\.1\.\bй\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатой
<10\.1\.1\.\bый\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатый
<10\.1\.1\.\bм\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятом
<10\.1\.1\.\bм\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатом
<10\.1\.1\.\bм\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатом
<10\.1\.1\.\bми\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятыми
<10\.1\.1\.\bми\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатыми
<10\.1\.1\.\bми\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатыми
<10\.1\.1\.\bму\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десяти
<10\.1\.1\.\bму\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцати
<10\.1\.1\.\bму\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцати
<10\.1\.1\.\bму\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцати
<10\.1\.1\.\bму\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцати
<10\.1\.1\.\bму\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцати
<10\.1\.1\.\bму\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцати
<10\.1\.1\.\bму\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцати
<10\.1\.1\.\bму\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцати
<10\.1\.1\.\bму\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцати
<10\.1\.1\.\bо\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десять
<10\.1\.1\.\bо\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцать
<10\.1\.1\.\bо\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцать
<10\.1\.1\.\bо\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцать
<10\.1\.1\.\bо\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцать
<10\.1\.1\.\bо\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцать
<10\.1\.1\.\bо\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцать
<10\.1\.1\.\bо\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцать
<10\.1\.1\.\bо\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцать
<10\.1\.1\.\bо\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцать
<10\.1\.1\.\bого\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятого
<10\.1\.1\.\bого\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатого
<10\.1\.1\.\bого\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатого
<10\.1\.1\.\bой\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десяти
<10\.1\.1\.\bой\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцати
<10\.1\.1\.\bой\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцати
<10\.1\.1\.\bой\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцати
<10\.1\.1\.\bой\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцати
<10\.1\.1\.\bой\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцати
<10\.1\.1\.\bой\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцати
<10\.1\.1\.\bой\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцати
<10\.1\.1\.\bой\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцати
<10\.1\.1\.\bой\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцати
<10\.1\.1\.\bом\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десяти
<10\.1\.1\.\bом\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцати
<10\.1\.1\.\bом\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцати
<10\.1\.1\.\bом\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцати
<10\.1\.1\.\bом\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцати
<10\.1\.1\.\bом\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцати
<10\.1\.1\.\bом\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцати
<10\.1\.1\.\bом\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцати
<10\.1\.1\.\bом\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцати
<10\.1\.1\.\bом\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцати
<10\.1\.1\.\bому\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятому
<10\.1\.1\.\bому\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатому
<10\.1\.1\.\bому\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатому
<10\.1\.1\.\bою\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятью
<10\.1\.1\.\bою\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатью
<10\.1\.1\.\bою\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатью
<10\.1\.1\.\bу\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десять
<10\.1\.1\.\bу\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцать
<10\.1\.1\.\bу\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцать
<10\.1\.1\.\bу\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцать
<10\.1\.1\.\bу\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцать
<10\.1\.1\.\bу\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцать
<10\.1\.1\.\bу\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцать
<10\.1\.1\.\bу\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцать
<10\.1\.1\.\bу\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцать
<10\.1\.1\.\bу\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцать
<10\.1\.1\.\bх\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятых
<10\.1\.1\.\bх\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатых
<10\.1\.1\.\bх\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатых
<10\.1\.1\.\bые\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятые
<10\.1\.1\.\bые\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатые
<10\.1\.1\.\bые\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатые
<10\.1\.1\.\bым\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятым
<10\.1\.1\.\bым\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатым
<10\.1\.1\.\bым\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатым
<10\.1\.1\.\bю\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятую
<10\.1\.1\.\bю\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатую
<10\.1\.1\.\bю\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатую
<10\.1\.1\.\bя\b>\s<10\.0\.0\.([а-яё]{1,3})?>=десятая
<10\.1\.1\.\bя\b>\s<10\.0\.1\.([а-яё]{1,3})?>=одиннадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.2\.([а-яё]{1,3})?>=двенадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.3\.([а-яё]{1,3})?>=тринадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.4\.([а-яё]{1,3})?>=четырнадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.5\.([а-яё]{1,3})?>=пятнадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.6\.([а-яё]{1,3})?>=шестнадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.7\.([а-яё]{1,3})?>=семнадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.8\.([а-яё]{1,3})?>=восемнадцатая
<10\.1\.1\.\bя\b>\s<10\.0\.9\.([а-яё]{1,3})?>=девятнадцатая

<10\.1\.1\.>\s<10\.0\.0\.\bро\b>=десятеро
<10\.1\.1\.>\s<10\.0\.1\.\bро\b>=одиннадцатеро
<10\.1\.1\.>\s<10\.0\.2\.\bро\b>=двенадцатеро
<10\.1\.1\.>\s<10\.0\.3\.\bро\b>=тринадцатеро
<10\.1\.1\.>\s<10\.0\.4\.\bро\b>=четырнадцатеро
<10\.1\.1\.>\s<10\.0\.5\.\bро\b>=пятнадцатеро
<10\.1\.1\.>\s<10\.0\.6\.\bро\b>=шестнадцатеро
<10\.1\.1\.>\s<10\.0\.7\.\bро\b>=семнадцатеро
<10\.1\.1\.>\s<10\.0\.8\.\bро\b>=восемнадцатеро
<10\.1\.1\.>\s<10\.0\.9\.\bро\b>=девятнадцатеро
<10\.1\.1\.>\s<10\.0\.0\.\bых\b>=десятерых
<10\.1\.1\.>\s<10\.0\.1\.\bых\b>=одиннадцатерых
<10\.1\.1\.>\s<10\.0\.2\.\bых\b>=двенадцатерых
<10\.1\.1\.>\s<10\.0\.3\.\bых\b>=тринадцатерых
<10\.1\.1\.>\s<10\.0\.4\.\bых\b>=четырнадцатерых
<10\.1\.1\.>\s<10\.0\.5\.\bых\b>=пятнадцатерых
<10\.1\.1\.>\s<10\.0\.6\.\bых\b>=шестнадцатерых
<10\.1\.1\.>\s<10\.0\.7\.\bых\b>=семнадцатерых
<10\.1\.1\.>\s<10\.0\.8\.\bых\b>=восемнадцатерых
<10\.1\.1\.>\s<10\.0\.9\.\bых\b>=девятнадцатерых
<10\.1\.1\.>\s<10\.0\.0\.\bрым\b>=десятерым
<10\.1\.1\.>\s<10\.0\.1\.\bрым\b>=одиннадцатерым
<10\.1\.1\.>\s<10\.0\.2\.\bрым\b>=двенадцатерым
<10\.1\.1\.>\s<10\.0\.3\.\bрым\b>=тринадцатерым
<10\.1\.1\.>\s<10\.0\.4\.\bрым\b>=четырнадцатерым
<10\.1\.1\.>\s<10\.0\.5\.\bрым\b>=пятнадцатерым
<10\.1\.1\.>\s<10\.0\.6\.\bрым\b>=шестнадцатерым
<10\.1\.1\.>\s<10\.0\.7\.\bрым\b>=семнадцатерым
<10\.1\.1\.>\s<10\.0\.8\.\bрым\b>=восемнадцатерым
<10\.1\.1\.>\s<10\.0\.9\.\bрым\b>=девятнадцатерым
<10\.1\.1\.>\s<10\.0\.0\.\bро\b>=десятеро
<10\.1\.1\.>\s<10\.0\.1\.\bро\b>=одиннадцатеро
<10\.1\.1\.>\s<10\.0\.2\.\bро\b>=двенадцатеро
<10\.1\.1\.>\s<10\.0\.3\.\bро\b>=тринадцатеро
<10\.1\.1\.>\s<10\.0\.4\.\bро\b>=четырнадцатеро
<10\.1\.1\.>\s<10\.0\.5\.\bро\b>=пятнадцатеро
<10\.1\.1\.>\s<10\.0\.6\.\bро\b>=шестнадцатеро
<10\.1\.1\.>\s<10\.0\.7\.\bро\b>=семнадцатеро
<10\.1\.1\.>\s<10\.0\.8\.\bро\b>=восемнадцатеро
<10\.1\.1\.>\s<10\.0\.9\.\bро\b>=девятнадцатеро
<10\.1\.1\.>\s<10\.0\.0\.\bых\b>=десятерых
<10\.1\.1\.>\s<10\.0\.1\.\bых\b>=одиннадцатерых
<10\.1\.1\.>\s<10\.0\.2\.\bых\b>=двенадцатерых
<10\.1\.1\.>\s<10\.0\.3\.\bых\b>=тринадцатерых
<10\.1\.1\.>\s<10\.0\.4\.\bых\b>=четырнадцатерых
<10\.1\.1\.>\s<10\.0\.5\.\bых\b>=пятнадцатерых
<10\.1\.1\.>\s<10\.0\.6\.\bых\b>=шестнадцатерых
<10\.1\.1\.>\s<10\.0\.7\.\bых\b>=семнадцатерых
<10\.1\.1\.>\s<10\.0\.8\.\bых\b>=восемнадцатерых
<10\.1\.1\.>\s<10\.0\.9\.\bых\b>=девятнадцатерых
<10\.1\.1\.>\s<10\.0\.0\.\bыми\b>=десятерыми
<10\.1\.1\.>\s<10\.0\.1\.\bыми\b>=одиннадцатерыми
<10\.1\.1\.>\s<10\.0\.2\.\bыми\b>=двенадцатерыми
<10\.1\.1\.>\s<10\.0\.3\.\bыми\b>=тринадцатерыми
<10\.1\.1\.>\s<10\.0\.4\.\bыми\b>=четырнадцатерыми
<10\.1\.1\.>\s<10\.0\.5\.\bыми\b>=пятнадцатерыми
<10\.1\.1\.>\s<10\.0\.6\.\bыми\b>=шестнадцатерыми
<10\.1\.1\.>\s<10\.0\.7\.\bыми\b>=семнадцатерыми
<10\.1\.1\.>\s<10\.0\.8\.\bыми\b>=восемнадцатерыми
<10\.1\.1\.>\s<10\.0\.9\.\bыми\b>=девятнадцатерыми
<10\.1\.1\.>\s<10\.0\.0\.\bах\b>=десятерых
<10\.1\.1\.>\s<10\.0\.1\.\bах\b>=одиннадцатерых
<10\.1\.1\.>\s<10\.0\.2\.\bах\b>=двенадцатерых
<10\.1\.1\.>\s<10\.0\.3\.\bах\b>=тринадцатерых
<10\.1\.1\.>\s<10\.0\.4\.\bах\b>=четырнадцатерых
<10\.1\.1\.>\s<10\.0\.5\.\bах\b>=пятнадцатерых
<10\.1\.1\.>\s<10\.0\.6\.\bах\b>=шестнадцатерых
<10\.1\.1\.>\s<10\.0\.7\.\bах\b>=семнадцатерых
<10\.1\.1\.>\s<10\.0\.8\.\bах\b>=восемнадцатерых
<10\.1\.1\.>\s<10\.0\.9\.\bах\b>=девятнадцатерых
#
<10\.1\.1\.>\s<10\.0\.0\.\bа\b>=десять
<10\.1\.1\.>\s<10\.0\.1\.\bа\b>=одиннадцать
<10\.1\.1\.>\s<10\.0\.2\.\bа\b>=двенадцать
<10\.1\.1\.>\s<10\.0\.3\.\bа\b>=тринадцать
<10\.1\.1\.>\s<10\.0\.4\.\bа\b>=четырнадцать
<10\.1\.1\.>\s<10\.0\.5\.\bа\b>=пятнадцать
<10\.1\.1\.>\s<10\.0\.6\.\bа\b>=шестнадцать
<10\.1\.1\.>\s<10\.0\.7\.\bа\b>=семнадцать
<10\.1\.1\.>\s<10\.0\.8\.\bа\b>=восемнадцать
<10\.1\.1\.>\s<10\.0\.9\.\bа\b>=девятнадцать
<10\.1\.1\.>\s<10\.0\.0\.\bго\b>=десяти
<10\.1\.1\.>\s<10\.0\.1\.\bго\b>=одиннадцати
<10\.1\.1\.>\s<10\.0\.2\.\bго\b>=двенадцати
<10\.1\.1\.>\s<10\.0\.3\.\bго\b>=тринадцати
<10\.1\.1\.>\s<10\.0\.4\.\bго\b>=четырнадцати
<10\.1\.1\.>\s<10\.0\.5\.\bго\b>=пятнадцати
<10\.1\.1\.>\s<10\.0\.6\.\bго\b>=шестнадцати
<10\.1\.1\.>\s<10\.0\.7\.\bго\b>=семнадцати
<10\.1\.1\.>\s<10\.0\.8\.\bго\b>=восемнадцати
<10\.1\.1\.>\s<10\.0\.9\.\bго\b>=девятнадцати
<10\.1\.1\.>\s<10\.0\.0\.\bе\b>=десятое
<10\.1\.1\.>\s<10\.0\.1\.\bе\b>=одиннадцатое
<10\.1\.1\.>\s<10\.0\.2\.\bе\b>=двенадцатое
<10\.1\.1\.>\s<10\.0\.3\.\bе\b>=тринадцатое
<10\.1\.1\.>\s<10\.0\.4\.\bе\b>=четырнадцатое
<10\.1\.1\.>\s<10\.0\.5\.\bе\b>=пятнадцатое
<10\.1\.1\.>\s<10\.0\.6\.\bе\b>=шестнадцатое
<10\.1\.1\.>\s<10\.0\.7\.\bе\b>=семнадцатое
<10\.1\.1\.>\s<10\.0\.8\.\bе\b>=восемнадцатое
<10\.1\.1\.>\s<10\.0\.9\.\bе\b>=девятнадцатое
<10\.1\.1\.>\s<10\.0\.0\.\bи\b>=десять
<10\.1\.1\.>\s<10\.0\.1\.\bи\b>=одиннадцать
<10\.1\.1\.>\s<10\.0\.2\.\bи\b>=двенадцать
<10\.1\.1\.>\s<10\.0\.3\.\bи\b>=тринадцать
<10\.1\.1\.>\s<10\.0\.4\.\bи\b>=четырнадцать
<10\.1\.1\.>\s<10\.0\.5\.\bи\b>=пятнадцать
<10\.1\.1\.>\s<10\.0\.6\.\bи\b>=шестнадцать
<10\.1\.1\.>\s<10\.0\.7\.\bи\b>=семнадцать
<10\.1\.1\.>\s<10\.0\.8\.\bи\b>=восемнадцать
<10\.1\.1\.>\s<10\.0\.9\.\bи\b>=девятнадцать
<10\.1\.1\.>\s<10\.0\.0\.\bим\b>=десятью
<10\.1\.1\.>\s<10\.0\.1\.\bим\b>=одиннадцатью
<10\.1\.1\.>\s<10\.0\.2\.\bим\b>=двенадцатью
<10\.1\.1\.>\s<10\.0\.3\.\bим\b>=тринадцатью
<10\.1\.1\.>\s<10\.0\.4\.\bим\b>=четырнадцатью
<10\.1\.1\.>\s<10\.0\.5\.\bим\b>=пятнадцатью
<10\.1\.1\.>\s<10\.0\.6\.\bим\b>=шестнадцатью
<10\.1\.1\.>\s<10\.0\.7\.\bим\b>=семнадцатью
<10\.1\.1\.>\s<10\.0\.8\.\bим\b>=восемнадцатью
<10\.1\.1\.>\s<10\.0\.9\.\bим\b>=девятнадцатью
<10\.1\.1\.>\s<10\.0\.0\.\bими\b>=десятью
<10\.1\.1\.>\s<10\.0\.1\.\bими\b>=одиннадцатью
<10\.1\.1\.>\s<10\.0\.2\.\bими\b>=двенадцатью
<10\.1\.1\.>\s<10\.0\.3\.\bими\b>=тринадцатью
<10\.1\.1\.>\s<10\.0\.4\.\bими\b>=четырнадцатью
<10\.1\.1\.>\s<10\.0\.5\.\bими\b>=пятнадцатью
<10\.1\.1\.>\s<10\.0\.6\.\bими\b>=шестнадцатью
<10\.1\.1\.>\s<10\.0\.7\.\bими\b>=семнадцатью
<10\.1\.1\.>\s<10\.0\.8\.\bими\b>=восемнадцатью
<10\.1\.1\.>\s<10\.0\.9\.\bими\b>=девятнадцатью
<10\.1\.1\.>\s<10\.0\.0\.\bих\b>=десяти
<10\.1\.1\.>\s<10\.0\.1\.\bих\b>=одиннадцати
<10\.1\.1\.>\s<10\.0\.2\.\bих\b>=двенадцати
<10\.1\.1\.>\s<10\.0\.3\.\bих\b>=тринадцати
<10\.1\.1\.>\s<10\.0\.4\.\bих\b>=четырнадцати
<10\.1\.1\.>\s<10\.0\.5\.\bих\b>=пятнадцати
<10\.1\.1\.>\s<10\.0\.6\.\bих\b>=шестнадцати
<10\.1\.1\.>\s<10\.0\.7\.\bих\b>=семнадцати
<10\.1\.1\.>\s<10\.0\.8\.\bих\b>=восемнадцати
<10\.1\.1\.>\s<10\.0\.9\.\bих\b>=девятнадцати
<10\.1\.1\.>\s<10\.0\.0\.\bй\b>=десятой
<10\.1\.1\.>\s<10\.0\.0\.\bый\b>=десятый
<10\.1\.1\.>\s<10\.0\.1\.\bй\b>=одиннадцатой
<10\.1\.1\.>\s<10\.0\.1\.\bый\b>=одиннадцатый
<10\.1\.1\.>\s<10\.0\.2\.\bй\b>=двенадцатой
<10\.1\.1\.>\s<10\.0\.2\.\bый\b>=двенадцатый
<10\.1\.1\.>\s<10\.0\.3\.\bй\b>=тринадцатой
<10\.1\.1\.>\s<10\.0\.3\.\bый\b>=тринадцатый
<10\.1\.1\.>\s<10\.0\.4\.\bй\b>=четырнадцатой
<10\.1\.1\.>\s<10\.0\.4\.\bый\b>=четырнадцатый
<10\.1\.1\.>\s<10\.0\.5\.\bй\b>=пятнадцатой
<10\.1\.1\.>\s<10\.0\.5\.\bый\b>=пятнадцатый
<10\.1\.1\.>\s<10\.0\.6\.\bй\b>=шестнадцатой
<10\.1\.1\.>\s<10\.0\.6\.\bый\b>=шестнадцатый
<10\.1\.1\.>\s<10\.0\.7\.\bй\b>=семнадцатой
<10\.1\.1\.>\s<10\.0\.7\.\bый\b>=семнадцатый
<10\.1\.1\.>\s<10\.0\.8\.\bй\b>=восемнадцатой
<10\.1\.1\.>\s<10\.0\.8\.\bый\b>=восемнадцатый
<10\.1\.1\.>\s<10\.0\.9\.\bй\b>=девятнадцатой
<10\.1\.1\.>\s<10\.0\.9\.\bый\b>=девятнадцатый
<10\.1\.1\.>\s<10\.0\.0\.\bм\b>=десятом
<10\.1\.1\.>\s<10\.0\.1\.\bм\b>=одиннадцатом
<10\.1\.1\.>\s<10\.0\.2\.\bм\b>=двенадцатом
<10\.1\.1\.>\s<10\.0\.3\.\bм\b>=тринадцатом
<10\.1\.1\.>\s<10\.0\.4\.\bм\b>=четырнадцатом
<10\.1\.1\.>\s<10\.0\.5\.\bм\b>=пятнадцатом
<10\.1\.1\.>\s<10\.0\.6\.\bм\b>=шестнадцатом
<10\.1\.1\.>\s<10\.0\.7\.\bм\b>=семнадцатом
<10\.1\.1\.>\s<10\.0\.8\.\bм\b>=восемнадцатом
<10\.1\.1\.>\s<10\.0\.9\.\bм\b>=девятнадцатом
<10\.1\.1\.>\s<10\.0\.0\.\bми\b>=десятыми
<10\.1\.1\.>\s<10\.0\.1\.\bми\b>=одиннадцатыми
<10\.1\.1\.>\s<10\.0\.2\.\bми\b>=двенадцатыми
<10\.1\.1\.>\s<10\.0\.3\.\bми\b>=тринадцатыми
<10\.1\.1\.>\s<10\.0\.4\.\bми\b>=четырнадцатыми
<10\.1\.1\.>\s<10\.0\.5\.\bми\b>=пятнадцатыми
<10\.1\.1\.>\s<10\.0\.6\.\bми\b>=шестнадцатыми
<10\.1\.1\.>\s<10\.0\.7\.\bми\b>=семнадцатыми
<10\.1\.1\.>\s<10\.0\.8\.\bми\b>=восемнадцатыми
<10\.1\.1\.>\s<10\.0\.9\.\bми\b>=девятнадцатыми
<10\.1\.1\.>\s<10\.0\.0\.\bму\b>=десяти
<10\.1\.1\.>\s<10\.0\.1\.\bму\b>=одиннадцати
<10\.1\.1\.>\s<10\.0\.2\.\bму\b>=двенадцати
<10\.1\.1\.>\s<10\.0\.3\.\bму\b>=тринадцати
<10\.1\.1\.>\s<10\.0\.4\.\bму\b>=четырнадцати
<10\.1\.1\.>\s<10\.0\.5\.\bму\b>=пятнадцати
<10\.1\.1\.>\s<10\.0\.6\.\bму\b>=шестнадцати
<10\.1\.1\.>\s<10\.0\.7\.\bму\b>=семнадцати
<10\.1\.1\.>\s<10\.0\.8\.\bму\b>=восемнадцати
<10\.1\.1\.>\s<10\.0\.9\.\bму\b>=девятнадцати
<10\.1\.1\.>\s<10\.0\.0\.\bо\b>=десять
<10\.1\.1\.>\s<10\.0\.1\.\bо\b>=одиннадцать
<10\.1\.1\.>\s<10\.0\.2\.\bо\b>=двенадцать
<10\.1\.1\.>\s<10\.0\.3\.\bо\b>=тринадцать
<10\.1\.1\.>\s<10\.0\.4\.\bо\b>=четырнадцать
<10\.1\.1\.>\s<10\.0\.5\.\bо\b>=пятнадцать
<10\.1\.1\.>\s<10\.0\.6\.\bо\b>=шестнадцать
<10\.1\.1\.>\s<10\.0\.7\.\bо\b>=семнадцать
<10\.1\.1\.>\s<10\.0\.8\.\bо\b>=восемнадцать
<10\.1\.1\.>\s<10\.0\.9\.\bо\b>=девятнадцать
<10\.1\.1\.>\s<10\.0\.0\.\bого\b>=десятого
<10\.1\.1\.>\s<10\.0\.1\.\bого\b>=одиннадцатого
<10\.1\.1\.>\s<10\.0\.2\.\bого\b>=двенадцатого
<10\.1\.1\.>\s<10\.0\.3\.\bого\b>=тринадцатого
<10\.1\.1\.>\s<10\.0\.4\.\bого\b>=четырнадцатого
<10\.1\.1\.>\s<10\.0\.5\.\bого\b>=пятнадцатого
<10\.1\.1\.>\s<10\.0\.6\.\bого\b>=шестнадцатого
<10\.1\.1\.>\s<10\.0\.7\.\bого\b>=семнадцатого
<10\.1\.1\.>\s<10\.0\.8\.\bого\b>=восемнадцатого
<10\.1\.1\.>\s<10\.0\.9\.\bого\b>=девятнадцатого
<10\.1\.1\.>\s<10\.0\.0\.\bой\b>=десяти
<10\.1\.1\.>\s<10\.0\.1\.\bой\b>=одиннадцати
<10\.1\.1\.>\s<10\.0\.2\.\bой\b>=двенадцати
<10\.1\.1\.>\s<10\.0\.3\.\bой\b>=тринадцати
<10\.1\.1\.>\s<10\.0\.4\.\bой\b>=четырнадцати
<10\.1\.1\.>\s<10\.0\.5\.\bой\b>=пятнадцати
<10\.1\.1\.>\s<10\.0\.6\.\bой\b>=шестнадцати
<10\.1\.1\.>\s<10\.0\.7\.\bой\b>=семнадцати
<10\.1\.1\.>\s<10\.0\.8\.\bой\b>=восемнадцати
<10\.1\.1\.>\s<10\.0\.9\.\bой\b>=девятнадцати
<10\.1\.1\.>\s<10\.0\.0\.\bом\b>=десяти
<10\.1\.1\.>\s<10\.0\.1\.\bом\b>=одиннадцати
<10\.1\.1\.>\s<10\.0\.2\.\bом\b>=двенадцати
<10\.1\.1\.>\s<10\.0\.3\.\bом\b>=тринадцати
<10\.1\.1\.>\s<10\.0\.4\.\bом\b>=четырнадцати
<10\.1\.1\.>\s<10\.0\.5\.\bом\b>=пятнадцати
<10\.1\.1\.>\s<10\.0\.6\.\bом\b>=шестнадцати
<10\.1\.1\.>\s<10\.0\.7\.\bом\b>=семнадцати
<10\.1\.1\.>\s<10\.0\.8\.\bом\b>=восемнадцати
<10\.1\.1\.>\s<10\.0\.9\.\bом\b>=девятнадцати
<10\.1\.1\.>\s<10\.0\.0\.\bому\b>=десятому
<10\.1\.1\.>\s<10\.0\.1\.\bому\b>=одиннадцатому
<10\.1\.1\.>\s<10\.0\.2\.\bому\b>=двенадцатому
<10\.1\.1\.>\s<10\.0\.3\.\bому\b>=тринадцатому
<10\.1\.1\.>\s<10\.0\.4\.\bому\b>=четырнадцатому
<10\.1\.1\.>\s<10\.0\.5\.\bому\b>=пятнадцатому
<10\.1\.1\.>\s<10\.0\.6\.\bому\b>=шестнадцатому
<10\.1\.1\.>\s<10\.0\.7\.\bому\b>=семнадцатому
<10\.1\.1\.>\s<10\.0\.8\.\bому\b>=восемнадцатому
<10\.1\.1\.>\s<10\.0\.9\.\bому\b>=девятнадцатому
<10\.1\.1\.>\s<10\.0\.0\.\bою\b>=десятью
<10\.1\.1\.>\s<10\.0\.1\.\bою\b>=одиннадцатью
<10\.1\.1\.>\s<10\.0\.2\.\bою\b>=двенадцатью
<10\.1\.1\.>\s<10\.0\.3\.\bою\b>=тринадцатью
<10\.1\.1\.>\s<10\.0\.4\.\bою\b>=четырнадцатью
<10\.1\.1\.>\s<10\.0\.5\.\bою\b>=пятнадцатью
<10\.1\.1\.>\s<10\.0\.6\.\bою\b>=шестнадцатью
<10\.1\.1\.>\s<10\.0\.7\.\bою\b>=семнадцатью
<10\.1\.1\.>\s<10\.0\.8\.\bою\b>=восемнадцатью
<10\.1\.1\.>\s<10\.0\.9\.\bою\b>=девятнадцатью
<10\.1\.1\.>\s<10\.0\.0\.\bу\b>=десять
<10\.1\.1\.>\s<10\.0\.1\.\bу\b>=одиннадцать
<10\.1\.1\.>\s<10\.0\.2\.\bу\b>=двенадцать
<10\.1\.1\.>\s<10\.0\.3\.\bу\b>=тринадцать
<10\.1\.1\.>\s<10\.0\.4\.\bу\b>=четырнадцать
<10\.1\.1\.>\s<10\.0\.5\.\bу\b>=пятнадцать
<10\.1\.1\.>\s<10\.0\.6\.\bу\b>=шестнадцать
<10\.1\.1\.>\s<10\.0\.7\.\bу\b>=семнадцать
<10\.1\.1\.>\s<10\.0\.8\.\bу\b>=восемнадцать
<10\.1\.1\.>\s<10\.0\.9\.\bу\b>=девятнадцать
<10\.1\.1\.>\s<10\.0\.0\.\bх\b>=десятых
<10\.1\.1\.>\s<10\.0\.1\.\bх\b>=одиннадцатых
<10\.1\.1\.>\s<10\.0\.2\.\bх\b>=двенадцатых
<10\.1\.1\.>\s<10\.0\.3\.\bх\b>=тринадцатых
<10\.1\.1\.>\s<10\.0\.4\.\bх\b>=четырнадцатых
<10\.1\.1\.>\s<10\.0\.5\.\bх\b>=пятнадцатых
<10\.1\.1\.>\s<10\.0\.6\.\bх\b>=шестнадцатых
<10\.1\.1\.>\s<10\.0\.7\.\bх\b>=семнадцатых
<10\.1\.1\.>\s<10\.0\.8\.\bх\b>=восемнадцатых
<10\.1\.1\.>\s<10\.0\.9\.\bх\b>=девятнадцатых
<10\.1\.1\.>\s<10\.0\.0\.\bые\b>=десятые
<10\.1\.1\.>\s<10\.0\.1\.\bые\b>=одиннадцатые
<10\.1\.1\.>\s<10\.0\.2\.\bые\b>=двенадцатые
<10\.1\.1\.>\s<10\.0\.3\.\bые\b>=тринадцатые
<10\.1\.1\.>\s<10\.0\.4\.\bые\b>=четырнадцатые
<10\.1\.1\.>\s<10\.0\.5\.\bые\b>=пятнадцатые
<10\.1\.1\.>\s<10\.0\.6\.\bые\b>=шестнадцатые
<10\.1\.1\.>\s<10\.0\.7\.\bые\b>=семнадцатые
<10\.1\.1\.>\s<10\.0\.8\.\bые\b>=восемнадцатые
<10\.1\.1\.>\s<10\.0\.9\.\bые\b>=девятнадцатые
<10\.1\.1\.>\s<10\.0\.0\.\bым\b>=десятым
<10\.1\.1\.>\s<10\.0\.1\.\bым\b>=одиннадцатым
<10\.1\.1\.>\s<10\.0\.2\.\bым\b>=двенадцатым
<10\.1\.1\.>\s<10\.0\.3\.\bым\b>=тринадцатым
<10\.1\.1\.>\s<10\.0\.4\.\bым\b>=четырнадцатым
<10\.1\.1\.>\s<10\.0\.5\.\bым\b>=пятнадцатым
<10\.1\.1\.>\s<10\.0\.6\.\bым\b>=шестнадцатым
<10\.1\.1\.>\s<10\.0\.7\.\bым\b>=семнадцатым
<10\.1\.1\.>\s<10\.0\.8\.\bым\b>=восемнадцатым
<10\.1\.1\.>\s<10\.0\.9\.\bым\b>=девятнадцатым
<10\.1\.1\.>\s<10\.0\.0\.\bю\b>=десятую
<10\.1\.1\.>\s<10\.0\.1\.\bю\b>=одиннадцатую
<10\.1\.1\.>\s<10\.0\.2\.\bю\b>=двенадцатую
<10\.1\.1\.>\s<10\.0\.3\.\bю\b>=тринадцатую
<10\.1\.1\.>\s<10\.0\.4\.\bю\b>=четырнадцатую
<10\.1\.1\.>\s<10\.0\.5\.\bю\b>=пятнадцатую
<10\.1\.1\.>\s<10\.0\.6\.\bю\b>=шестнадцатую
<10\.1\.1\.>\s<10\.0\.7\.\bю\b>=семнадцатую
<10\.1\.1\.>\s<10\.0\.8\.\bю\b>=восемнадцатую
<10\.1\.1\.>\s<10\.0\.9\.\bю\b>=девятнадцатую
<10\.1\.1\.>\s<10\.0\.0\.\bя\b>=десятая
<10\.1\.1\.>\s<10\.0\.1\.\bя\b>=одиннадцатая
<10\.1\.1\.>\s<10\.0\.2\.\bя\b>=двенадцатая
<10\.1\.1\.>\s<10\.0\.3\.\bя\b>=тринадцатая
<10\.1\.1\.>\s<10\.0\.4\.\bя\b>=четырнадцатая
<10\.1\.1\.>\s<10\.0\.5\.\bя\b>=пятнадцатая
<10\.1\.1\.>\s<10\.0\.6\.\bя\b>=шестнадцатая
<10\.1\.1\.>\s<10\.0\.7\.\bя\b>=семнадцатая
<10\.1\.1\.>\s<10\.0\.8\.\bя\b>=восемнадцатая
<10\.1\.1\.>\s<10\.0\.9\.\bя\b>=девятнадцатая
#
<10\.1\.1\.\bа\b>=десять
<10\.1\.1\.\bго\b>=десяти
<10\.1\.1\.\bе\b>=десятое
<10\.1\.1\.\bи\b>=десять
<10\.1\.1\.\bим\b>=десятью
<10\.1\.1\.\bими\b>=десятью
<10\.1\.1\.\bих\b>=десяти
<10\.1\.1\.\bй\b>=десятой
<10\.1\.1\.\bый\b>=десятый
<10\.1\.1\.\bм\b>=десятом
<10\.1\.1\.\bми\b>=десятыми
<10\.1\.1\.\bму\b>=десяти
<10\.1\.1\.\bо\b>=десять
<10\.1\.1\.\bого\b>=десятого
<10\.1\.1\.\bой\b>=десяти
<10\.1\.1\.\bом\b>=десяти
<10\.1\.1\.\bому\b>=десятому
<10\.1\.1\.\bою\b>=десятью
<10\.1\.1\.\bу\b>=десять
<10\.1\.1\.\bх\b>=десятых
<10\.1\.1\.\bые\b>=десятые
<10\.1\.1\.\bым\b>=десятым
<10\.1\.1\.\bю\b>=десятую
<10\.1\.1\.\bя\b>=десятая
<10\.1\.1\.\bро\b>=десятеро
<10\.1\.1\.\bых\b>=десятерых
<10\.1\.1\.\bрым\b>=десятерым
<10\.1\.1\.\bро\b>=десятеро
<10\.1\.1\.\bых\b>=десятерых
<10\.1\.1\.\bыми\b>=десятерыми
<10\.1\.1\.\bах\b>=десятерых
<10\.1\.1\.>=десять
#
#<10\.3\.1\.\bах\b>=тысячах
<10\.0\.1\.>=один
<10\.0\.1\.\bро\b>=один
<10\.0\.1\.\bых\b>=одного
<10\.0\.1\.\bрым\b>=одному
<10\.0\.1\.\bро\b>=один
<10\.0\.1\.\bых\b>=одного
<10\.0\.1\.\bыми\b>=одним
<10\.0\.1\.\bах\b>=одном
<10\.0\.1\.\bа\b>=одна
<10\.0\.1\.\bго\b>=одного
<10\.0\.1\.\bе\b>=первое
<10\.0\.1\.\bи\b>=одни
<10\.0\.1\.\bим\b>=одним
<10\.0\.1\.\bими\b>=одними
<10\.0\.1\.\bих\b>=одних
<10\.0\.1\.\bй\b>=первой
<10\.0\.1\.\bый\b>=первый
<10\.0\.1\.\bм\b>=первом
<10\.0\.1\.\bми\b>=первыми
<10\.0\.1\.\bму\b>=одному
<10\.0\.1\.\bо\b>=одно
<10\.0\.1\.\bого\b>=первого
<10\.0\.1\.\bой\b>=одной
<10\.0\.1\.\bом\b>=одном
<10\.0\.1\.\bому\b>=первому
<10\.0\.1\.\bою\b>=одною
<10\.0\.1\.\bу\b>=одну
<10\.0\.1\.\bх\b>=первых
<10\.0\.1\.\bые\b>=первые
<10\.0\.1\.\bым\b>=первым
<10\.0\.1\.\bю\b>=первую
<10\.0\.1\.\bя\b>=первая
<10\.0\.2\.>=два
<10\.0\.2\.\bро\b>=двое
<10\.0\.2\.\bых\b>=двоих
<10\.0\.2\.\bрым\b>=двоим
<10\.0\.2\.\bро\b>=двое
<10\.0\.2\.\bых\b>=двоих
<10\.0\.2\.\bыми\b>=двоими
<10\.0\.2\.\bах\b>=двоих
<10\.0\.2\.\bа\b>=две
<10\.0\.2\.\bго\b>=двух
<10\.0\.2\.\bе\b>=второе
<10\.0\.2\.\bи\b>=два
<10\.0\.2\.\bим\b>=двумя
<10\.0\.2\.\bими\b>=двумя
<10\.0\.2\.\bих\b>=двух
<10\.0\.2\.\bй\b>=второй
<10\.0\.2\.\bый\b>=второй
<10\.0\.2\.\bм\b>=втором
<10\.0\.2\.\bми\b>=вторыми
<10\.0\.2\.\bму\b>=двум
<10\.0\.2\.\bо\b>=два
<10\.0\.2\.\bого\b>=второго
<10\.0\.2\.\bой\b>=двух
<10\.0\.2\.\bом\b>=двух
<10\.0\.2\.\bому\b>=второму
<10\.0\.2\.\bою\b>=двумя
<10\.0\.2\.\bу\b>=две
<10\.0\.2\.\bх\b>=вторых
<10\.0\.2\.\bые\b>=вторые
<10\.0\.2\.\bым\b>=вторым
<10\.0\.2\.\bю\b>=вторую
<10\.0\.2\.\bя\b>=вторая
<10\.0\.3\.>=три
<10\.0\.3\.\bро\b>=трое
<10\.0\.3\.\bых\b>=троих
<10\.0\.3\.\bрым\b>=троим
<10\.0\.3\.\bро\b>=трое
<10\.0\.3\.\bых\b>=троих
<10\.0\.3\.\bыми\b>=троими
<10\.0\.3\.\bах\b>=троих
<10\.0\.3\.\bа\b>=три
<10\.0\.3\.\bго\b>=трёх
<10\.0\.3\.\bе\b>=третье
<10\.0\.3\.\bи\b>=три
<10\.0\.3\.\bим\b>=тремя
<10\.0\.3\.\bими\b>=тремя
<10\.0\.3\.\bих\b>=трёх
<10\.0\.3\.\bый\b>=третий
<10\.0\.3\.\bй\b>=третьей
<10\.0\.3\.\bм\b>=третьем
<10\.0\.3\.\bми\b>=третьими
<10\.0\.3\.\bму\b>=трём
<10\.0\.3\.\bо\b>=три
<10\.0\.3\.\bого\b>=третьего
<10\.0\.3\.\bой\b>=трёх
<10\.0\.3\.\bом\b>=трёх
<10\.0\.3\.\bому\b>=третьему
<10\.0\.3\.\bою\b>=тремя
<10\.0\.3\.\bу\b>=три
<10\.0\.3\.\bх\b>=третьих
<10\.0\.3\.\bые\b>=третьи
<10\.0\.3\.\bым\b>=третьим
<10\.0\.3\.\bю\b>=третью
<10\.0\.3\.\bя\b>=третья
<10\.0\.4\.>=четыре
<10\.0\.4\.\bро\b>=четверо
<10\.0\.4\.\bых\b>=четверых
<10\.0\.4\.\bрым\b>=четверым
<10\.0\.4\.\bро\b>=четверо
<10\.0\.4\.\bых\b>=четверых
<10\.0\.4\.\bыми\b>=четверыми
<10\.0\.4\.\bах\b>=четверых
<10\.0\.4\.\bа\b>=четыре
<10\.0\.4\.\bго\b>=четырёх
<10\.0\.4\.\bе\b>=четвёртое
<10\.0\.4\.\bи\b>=четыре
<10\.0\.4\.\bим\b>=четырьмя
<10\.0\.4\.\bими\b>=четырьмя
<10\.0\.4\.\bих\b>=четырёх
<10\.0\.4\.\bй\b>=четвёртой
<10\.0\.4\.\bый\b>=четвёртый
<10\.0\.4\.\bм\b>=четвёртом
<10\.0\.4\.\bми\b>=четвёртыми
<10\.0\.4\.\bму\b>=четырём
<10\.0\.4\.\bо\b>=четыре
<10\.0\.4\.\bого\b>=четвёртого
<10\.0\.4\.\bой\b>=четырёх
<10\.0\.4\.\bом\b>=четырёх
<10\.0\.4\.\bому\b>=четвёртому
<10\.0\.4\.\bою\b>=четырьмя
<10\.0\.4\.\bу\b>=четыре
<10\.0\.4\.\bх\b>=четвёртых
<10\.0\.4\.\bые\b>=четвёртые
<10\.0\.4\.\bым\b>=четвёртым
<10\.0\.4\.\bю\b>=четвёртую
<10\.0\.4\.\bя\b>=четвёртая
<10\.0\.5\.>=пять
<10\.0\.5\.\bро\b>=пятеро
<10\.0\.5\.\bых\b>=пятерых
<10\.0\.5\.\bрым\b>=пятерым
<10\.0\.5\.\bро\b>=пятеро
<10\.0\.5\.\bых\b>=пятерых
<10\.0\.5\.\bыми\b>=пятерыми
<10\.0\.5\.\bах\b>=пятерых
<10\.0\.5\.\bа\b>=пять
<10\.0\.5\.\bго\b>=пяти
<10\.0\.5\.\bе\b>=пятое
<10\.0\.5\.\bи\b>=пять
<10\.0\.5\.\bим\b>=пятью
<10\.0\.5\.\bими\b>=пятью
<10\.0\.5\.\bих\b>=пяти
<10\.0\.5\.\bй\b>=пятой
<10\.0\.5\.\bый\b>=пятый
<10\.0\.5\.\bм\b>=пятом
<10\.0\.5\.\bми\b>=пятыми
<10\.0\.5\.\bму\b>=пяти
<10\.0\.5\.\bо\b>=пять
<10\.0\.5\.\bого\b>=пятого
<10\.0\.5\.\bой\b>=пяти
<10\.0\.5\.\bом\b>=пяти
<10\.0\.5\.\bому\b>=пятому
<10\.0\.5\.\bою\b>=пятью
<10\.0\.5\.\bу\b>=пять
<10\.0\.5\.\bх\b>=пятых
<10\.0\.5\.\bые\b>=пятые
<10\.0\.5\.\bым\b>=пятым
<10\.0\.5\.\bю\b>=пятую
<10\.0\.5\.\bя\b>=пятая
<10\.0\.6\.>=шесть
<10\.0\.6\.\bро\b>=шестеро
<10\.0\.6\.\bых\b>=шестерых
<10\.0\.6\.\bрым\b>=шестерым
<10\.0\.6\.\bро\b>=шестеро
<10\.0\.6\.\bых\b>=шестерых
<10\.0\.6\.\bыми\b>=шестерыми
<10\.0\.6\.\bах\b>=шестерых
<10\.0\.6\.\bа\b>=шесть
<10\.0\.6\.\bго\b>=шести
<10\.0\.6\.\bе\b>=шестое
<10\.0\.6\.\bи\b>=шесть
<10\.0\.6\.\bим\b>=шестью
<10\.0\.6\.\bими\b>=шестью
<10\.0\.6\.\bих\b>=шести
<10\.0\.6\.\bй\b>=шестой
<10\.0\.6\.\bый\b>=шестой
<10\.0\.6\.\bм\b>=шестом
<10\.0\.6\.\bми\b>=шестыми
<10\.0\.6\.\bму\b>=шести
<10\.0\.6\.\bо\b>=шесть
<10\.0\.6\.\bого\b>=шестого
<10\.0\.6\.\bой\b>=шести
<10\.0\.6\.\bом\b>=шести
<10\.0\.6\.\bому\b>=шестому
<10\.0\.6\.\bою\b>=шестью
<10\.0\.6\.\bу\b>=шесть
<10\.0\.6\.\bх\b>=шестых
<10\.0\.6\.\bые\b>=шестые
<10\.0\.6\.\bым\b>=шестым
<10\.0\.6\.\bю\b>=шестую
<10\.0\.6\.\bя\b>=шестая
<10\.0\.7\.>=семь
<10\.0\.7\.\bро\b>=семеро
<10\.0\.7\.\bых\b>=семерых
<10\.0\.7\.\bрым\b>=семерым
<10\.0\.7\.\bро\b>=семеро
<10\.0\.7\.\bых\b>=семерых
<10\.0\.7\.\bыми\b>=семерыми
<10\.0\.7\.\bах\b>=семерых
<10\.0\.7\.\bа\b>=семь
<10\.0\.7\.\bго\b>=семи
<10\.0\.7\.\bе\b>=седьмое
<10\.0\.7\.\bи\b>=семь
<10\.0\.7\.\bим\b>=семью
<10\.0\.7\.\bими\b>=семью
<10\.0\.7\.\bих\b>=семи
<10\.0\.7\.\bй\b>=седьмой
<10\.0\.7\.\bый\b>=седьмой
<10\.0\.7\.\bм\b>=седьмом
<10\.0\.7\.\bми\b>=седьмыми
<10\.0\.7\.\bму\b>=семи
<10\.0\.7\.\bо\b>=семь
<10\.0\.7\.\bого\b>=седьмого
<10\.0\.7\.\bой\b>=семи
<10\.0\.7\.\bом\b>=семи
<10\.0\.7\.\bому\b>=седьмому
<10\.0\.7\.\bою\b>=семью
<10\.0\.7\.\bу\b>=семь
<10\.0\.7\.\bх\b>=седьмых
<10\.0\.7\.\bые\b>=седьмые
<10\.0\.7\.\bым\b>=седьмым
<10\.0\.7\.\bю\b>=седьмую
<10\.0\.7\.\bя\b>=седьмая
<10\.0\.8\.>=восемь
<10\.0\.8\.\bро\b>=восьмеро
<10\.0\.8\.\bых\b>=восьмерых
<10\.0\.8\.\bрым\b>=восьмерым
<10\.0\.8\.\bро\b>=восьмеро
<10\.0\.8\.\bых\b>=восьмерых
<10\.0\.8\.\bыми\b>=восьмерыми
<10\.0\.8\.\bах\b>=восьмерых
<10\.0\.8\.\bа\b>=восемь
<10\.0\.8\.\bго\b>=восьми
<10\.0\.8\.\bе\b>=восьмое
<10\.0\.8\.\bи\b>=восемь
<10\.0\.8\.\bим\b>=восемью
<10\.0\.8\.\bими\b>=восемью
<10\.0\.8\.\bих\b>=восьми
<10\.0\.8\.\bй\b>=восьмой
<10\.0\.8\.\bый\b>=восьмой
<10\.0\.8\.\bм\b>=восьмом
<10\.0\.8\.\bми\b>=восьмыми
<10\.0\.8\.\bму\b>=восьми
<10\.0\.8\.\bо\b>=восемь
<10\.0\.8\.\bого\b>=восьмого
<10\.0\.8\.\bой\b>=восьми
<10\.0\.8\.\bом\b>=восьми
<10\.0\.8\.\bому\b>=восьмому
<10\.0\.8\.\bою\b>=восемью
<10\.0\.8\.\bу\b>=восемь
<10\.0\.8\.\bх\b>=восьмых
<10\.0\.8\.\bые\b>=восьмые
<10\.0\.8\.\bым\b>=восьмым
<10\.0\.8\.\bю\b>=восьмую
<10\.0\.8\.\bя\b>=восьмая
<10\.0\.9\.>=девять
<10\.0\.9\.\bро\b>=девятеро
<10\.0\.9\.\bых\b>=девятерых
<10\.0\.9\.\bрым\b>=девятерым
<10\.0\.9\.\bро\b>=девятеро
<10\.0\.9\.\bых\b>=девятерых
<10\.0\.9\.\bыми\b>=девятерыми
<10\.0\.9\.\bах\b>=девятерых
<10\.0\.9\.\bа\b>=девять
<10\.0\.9\.\bго\b>=девяти
<10\.0\.9\.\bе\b>=девятое
<10\.0\.9\.\bи\b>=девять
<10\.0\.9\.\bим\b>=девятью
<10\.0\.9\.\bими\b>=девятью
<10\.0\.9\.\bих\b>=девяти
<10\.0\.9\.\bй\b>=девятой
<10\.0\.9\.\bый\b>=девятый
<10\.0\.9\.\bм\b>=девятом
<10\.0\.9\.\bми\b>=девятыми
<10\.0\.9\.\bму\b>=девяти
<10\.0\.9\.\bо\b>=девять
<10\.0\.9\.\bого\b>=девятого
<10\.0\.9\.\bой\b>=девяти
<10\.0\.9\.\bом\b>=девяти
<10\.0\.9\.\bому\b>=девятому
<10\.0\.9\.\bою\b>=девятью
<10\.0\.9\.\bу\b>=девять
<10\.0\.9\.\bх\b>=девятых
<10\.0\.9\.\bые\b>=девятые
<10\.0\.9\.\bым\b>=девятым
<10\.0\.9\.\bю\b>=девятую
<10\.0\.9\.\bя\b>=девятая
<10\.1\.2\.>=двадцать
<10\.1\.2\.\bро\b>=двадцатеро
<10\.1\.2\.\bых\b>=двадцатерых
<10\.1\.2\.\bрым\b>=двадцатерым
<10\.1\.2\.\bро\b>=двадцатеро
<10\.1\.2\.\bых\b>=двадцатерых
<10\.1\.2\.\bыми\b>=двадцатерыми
<10\.1\.2\.\bах\b>=двадцатерых
<10\.1\.2\.\bа\b>=двадцать
<10\.1\.2\.\bго\b>=двадцати
<10\.1\.2\.\bе\b>=двадцатое
<10\.1\.2\.\bи\b>=двадцать
<10\.1\.2\.\bим\b>=двадцатью
<10\.1\.2\.\bими\b>=двадцатью
<10\.1\.2\.\bих\b>=двадцати
<10\.1\.2\.\bй\b>=двадцатой
<10\.1\.2\.\bый\b>=двадцатый
<10\.1\.2\.\bм\b>=двадцатом
<10\.1\.2\.\bми\b>=двадцатыми
<10\.1\.2\.\bму\b>=двадцати
<10\.1\.2\.\bо\b>=двадцать
<10\.1\.2\.\bого\b>=двадцатого
<10\.1\.2\.\bой\b>=двадцати
<10\.1\.2\.\bом\b>=двадцати
<10\.1\.2\.\bому\b>=двадцатому
<10\.1\.2\.\bою\b>=двадцатью
<10\.1\.2\.\bу\b>=двадцать
<10\.1\.2\.\bх\b>=двадцатых
<10\.1\.2\.\bые\b>=двадцатые
<10\.1\.2\.\bым\b>=двадцатым
<10\.1\.2\.\bю\b>=двадцатую
<10\.1\.2\.\bя\b>=двадцатая
<10\.1\.3\.>=тридцать
<10\.1\.3\.\bро\b>=тридцатеро
<10\.1\.3\.\bых\b>=тридцатерых
<10\.1\.3\.\bрым\b>=тридцатерым
<10\.1\.3\.\bро\b>=тридцатеро
<10\.1\.3\.\bых\b>=тридцатерых
<10\.1\.3\.\bыми\b>=тридцатерыми
<10\.1\.3\.\bах\b>=тридцатерых
<10\.1\.3\.\bа\b>=тридцать
<10\.1\.3\.\bго\b>=тридцати
<10\.1\.3\.\bе\b>=тридцатое
<10\.1\.3\.\bи\b>=тридцать
<10\.1\.3\.\bим\b>=тридцатью
<10\.1\.3\.\bими\b>=тридцатью
<10\.1\.3\.\bих\b>=тридцати
<10\.1\.3\.\bй\b>=тридцатой
<10\.1\.3\.\bый\b>=тридцатый
<10\.1\.3\.\bм\b>=тридцатом
<10\.1\.3\.\bми\b>=тридцатыми
<10\.1\.3\.\bму\b>=тридцати
<10\.1\.3\.\bо\b>=тридцать
<10\.1\.3\.\bого\b>=тридцатого
<10\.1\.3\.\bой\b>=тридцати
<10\.1\.3\.\bом\b>=тридцати
<10\.1\.3\.\bому\b>=тридцатому
<10\.1\.3\.\bою\b>=тридцатью
<10\.1\.3\.\bу\b>=тридцать
<10\.1\.3\.\bх\b>=тридцатых
<10\.1\.3\.\bые\b>=тридцатые
<10\.1\.3\.\bым\b>=тридцатым
<10\.1\.3\.\bю\b>=тридцатую
<10\.1\.3\.\bя\b>=тридцатая
<10\.1\.4\.>=сорок
<10\.1\.4\.\bро\b>=сорок
<10\.1\.4\.\bых\b>=сорока
<10\.1\.4\.\bрым\b>=сорока
<10\.1\.4\.\bро\b>=сорок
<10\.1\.4\.\bых\b>=сорок
<10\.1\.4\.\bыми\b>=сорока
<10\.1\.4\.\bах\b>=сорока
<10\.1\.4\.\bа\b>=сорок
<10\.1\.4\.\bго\b>=сорока
<10\.1\.4\.\bе\b>=сороковое
<10\.1\.4\.\bи\b>=сорок
<10\.1\.4\.\bим\b>=сорока
<10\.1\.4\.\bими\b>=сорока
<10\.1\.4\.\bих\b>=сорока
<10\.1\.4\.\bй\b>=сороковой
<10\.1\.4\.\bый\b>=сороковой
<10\.1\.4\.\bм\b>=сороковом
<10\.1\.4\.\bми\b>=сороковыми
<10\.1\.4\.\bму\b>=сорока
<10\.1\.4\.\bо\b>=сорок
<10\.1\.4\.\bого\b>=сорокового
<10\.1\.4\.\bой\b>=сорока
<10\.1\.4\.\bом\b>=сорока
<10\.1\.4\.\bому\b>=сороковому
<10\.1\.4\.\bою\b>=сорока
<10\.1\.4\.\bу\b>=сорок
<10\.1\.4\.\bх\b>=сороковых
<10\.1\.4\.\bые\b>=сороковые
<10\.1\.4\.\bым\b>=сороковым
<10\.1\.4\.\bю\b>=сороковую
<10\.1\.4\.\bя\b>=сороковая
<10\.1\.5\.>=пятьдесят
<10\.1\.5\.\bро\b>=пятьдесят
<10\.1\.5\.\bых\b>=пятидесяти
<10\.1\.5\.\bрым\b>=пятидесяти
<10\.1\.5\.\bро\b>=пятьдесят
<10\.1\.5\.\bых\b>=пятьдесят
<10\.1\.5\.\bыми\b>=пятьюдесятью
<10\.1\.5\.\bах\b>=пятидесяти
<10\.1\.5\.\bа\b>=пятьдесят
<10\.1\.5\.\bго\b>=пятидесяти
<10\.1\.5\.\bе\b>=пятидесятое
<10\.1\.5\.\bи\b>=пятьдесят
<10\.1\.5\.\bим\b>=пятьюдесятью
<10\.1\.5\.\bими\b>=пятьюдесятью
<10\.1\.5\.\bих\b>=пятидесяти
<10\.1\.5\.\bй\b>=пятидесятой
<10\.1\.5\.\bый\b>=пятидесятый
<10\.1\.5\.\bм\b>=пятидесятом
<10\.1\.5\.\bми\b>=пятидесятыми
<10\.1\.5\.\bму\b>=пятидесяти
<10\.1\.5\.\bо\b>=пятьдесят
<10\.1\.5\.\bого\b>=пятидесятого
<10\.1\.5\.\bой\b>=пятидесяти
<10\.1\.5\.\bом\b>=пятидесяти
<10\.1\.5\.\bому\b>=пятидесятому
<10\.1\.5\.\bою\b>=пятьюдесятью
<10\.1\.5\.\bу\b>=пятьдесят
<10\.1\.5\.\bх\b>=пятидесятых
<10\.1\.5\.\bые\b>=пятидесятые
<10\.1\.5\.\bым\b>=пятидесятым
<10\.1\.5\.\bю\b>=пятидесятую
<10\.1\.5\.\bя\b>=пятидесятая
<10\.1\.6\.>=шестьдесят
<10\.1\.6\.\bро\b>=шестьдесят
<10\.1\.6\.\bых\b>=шестидесяти
<10\.1\.6\.\bрым\b>=шестидесяти
<10\.1\.6\.\bро\b>=шестьдесят
<10\.1\.6\.\bых\b>=шестьдесят
<10\.1\.6\.\bыми\b>=шестьюдесятью
<10\.1\.6\.\bах\b>=шестидесяти
<10\.1\.6\.\bа\b>=шестьдесят
<10\.1\.6\.\bго\b>=шестидесяти
<10\.1\.6\.\bе\b>=шестидесятое
<10\.1\.6\.\bи\b>=шестьдесят
<10\.1\.6\.\bим\b>=шестьюдесятью
<10\.1\.6\.\bими\b>=шестьюдесятью
<10\.1\.6\.\bих\b>=шестидесяти
<10\.1\.6\.\bй\b>=шестидесятой
<10\.1\.6\.\bый\b>=шестидесятый
<10\.1\.6\.\bм\b>=шестидесятом
<10\.1\.6\.\bми\b>=шестидесятыми
<10\.1\.6\.\bму\b>=шестидесяти
<10\.1\.6\.\bо\b>=шестьдесят
<10\.1\.6\.\bого\b>=шестидесятого
<10\.1\.6\.\bой\b>=шестидесяти
<10\.1\.6\.\bом\b>=шестидесяти
<10\.1\.6\.\bому\b>=шестидесятому
<10\.1\.6\.\bою\b>=шестьюдесятью
<10\.1\.6\.\bу\b>=шестьдесят
<10\.1\.6\.\bх\b>=шестидесятых
<10\.1\.6\.\bые\b>=шестидесятые
<10\.1\.6\.\bым\b>=шестидесятым
<10\.1\.6\.\bю\b>=шестидесятую
<10\.1\.6\.\bя\b>=шестидесятая
<10\.1\.7\.>=семьдесят
<10\.1\.7\.\bро\b>=семьдесят
<10\.1\.7\.\bых\b>=семидесяти
<10\.1\.7\.\bрым\b>=семидесяти
<10\.1\.7\.\bро\b>=семьдесят
<10\.1\.7\.\bых\b>=семьдесят
<10\.1\.7\.\bыми\b>=семьюдесятью
<10\.1\.7\.\bах\b>=семидесяти
<10\.1\.7\.\bа\b>=семьдесят
<10\.1\.7\.\bго\b>=семидесяти
<10\.1\.7\.\bе\b>=семидесятое
<10\.1\.7\.\bи\b>=семьдесят
<10\.1\.7\.\bим\b>=семьюдесятью
<10\.1\.7\.\bими\b>=семьюдесятью
<10\.1\.7\.\bих\b>=семидесяти
<10\.1\.7\.\bй\b>=семидесятой
<10\.1\.7\.\bый\b>=семидесятый
<10\.1\.7\.\bм\b>=семидесятом
<10\.1\.7\.\bми\b>=семидесятыми
<10\.1\.7\.\bму\b>=семидесяти
<10\.1\.7\.\bо\b>=семьдесят
<10\.1\.7\.\bого\b>=семидесятого
<10\.1\.7\.\bой\b>=семидесяти
<10\.1\.7\.\bом\b>=семидесяти
<10\.1\.7\.\bому\b>=семидесятому
<10\.1\.7\.\bою\b>=семьюдесятью
<10\.1\.7\.\bу\b>=семьдесят
<10\.1\.7\.\bх\b>=семидесятых
<10\.1\.7\.\bые\b>=семидесятые
<10\.1\.7\.\bым\b>=семидесятым
<10\.1\.7\.\bю\b>=семидесятую
<10\.1\.7\.\bя\b>=семидесятая
<10\.1\.8\.>=восемьдесят
<10\.1\.8\.\bро\b>=восемьдесят
<10\.1\.8\.\bых\b>=восьмидесяти
<10\.1\.8\.\bрым\b>=восьмидесяти
<10\.1\.8\.\bро\b>=восемьдесят
<10\.1\.8\.\bых\b>=восемьдесят
<10\.1\.8\.\bыми\b>=восьмьюдесятью
<10\.1\.8\.\bах\b>=восьмидесяти
<10\.1\.8\.\bа\b>=восемьдесят
<10\.1\.8\.\bго\b>=восьмидесяти
<10\.1\.8\.\bе\b>=восьмидесятое
<10\.1\.8\.\bи\b>=восемьдесят
<10\.1\.8\.\bим\b>=восьмьюдесятью
<10\.1\.8\.\bими\b>=восьмьюдесятью
<10\.1\.8\.\bих\b>=восьмидесяти
<10\.1\.8\.\bй\b>=восьмидесятой
<10\.1\.8\.\bый\b>=восьмидесятый
<10\.1\.8\.\bм\b>=восьмидесятом
<10\.1\.8\.\bми\b>=восьмидесятыми
<10\.1\.8\.\bму\b>=восьмидесяти
<10\.1\.8\.\bо\b>=восемьдесят
<10\.1\.8\.\bого\b>=восьмидесятого
<10\.1\.8\.\bой\b>=восьмидесяти
<10\.1\.8\.\bом\b>=восьмидесяти
<10\.1\.8\.\bому\b>=восьмидесятому
<10\.1\.8\.\bою\b>=восьмьюдесятью
<10\.1\.8\.\bу\b>=восемьдесят
<10\.1\.8\.\bх\b>=восьмидесятых
<10\.1\.8\.\bые\b>=восьмидесятые
<10\.1\.8\.\bым\b>=восьмидесятым
<10\.1\.8\.\bю\b>=восьмидесятую
<10\.1\.8\.\bя\b>=восьмидесятая
<10\.1\.9\.>=девяносто
<10\.1\.9\.\bро\b>=девяносто
<10\.1\.9\.\bых\b>=девяноста
<10\.1\.9\.\bрым\b>=девяноста
<10\.1\.9\.\bро\b>=девяносто
<10\.1\.9\.\bых\b>=девяносто
<10\.1\.9\.\bыми\b>=девяноста
<10\.1\.9\.\bах\b>=девяноста
<10\.1\.9\.\bа\b>=девяносто
<10\.1\.9\.\bго\b>=девяноста
<10\.1\.9\.\bе\b>=девяностое
<10\.1\.9\.\bи\b>=девяносто
<10\.1\.9\.\bим\b>=девяноста
<10\.1\.9\.\bими\b>=девяноста
<10\.1\.9\.\bих\b>=девяноста
<10\.1\.9\.\bй\b>=девяностой
<10\.1\.9\.\bый\b>=девяностый
<10\.1\.9\.\bм\b>=девяностом
<10\.1\.9\.\bми\b>=девяностыми
<10\.1\.9\.\bму\b>=девяноста
<10\.1\.9\.\bо\b>=девяносто
<10\.1\.9\.\bого\b>=девяностого
<10\.1\.9\.\bой\b>=девяноста
<10\.1\.9\.\bом\b>=девяноста
<10\.1\.9\.\bому\b>=девяностому
<10\.1\.9\.\bою\b>=девяноста
<10\.1\.9\.\bу\b>=девяносто
<10\.1\.9\.\bх\b>=девяностых
<10\.1\.9\.\bые\b>=девяностые
<10\.1\.9\.\bым\b>=девяностым
<10\.1\.9\.\bю\b>=девяностую
<10\.1\.9\.\bя\b>=девяностая
<10\.2\.1\.>=сто
<10\.2\.1\.\bро\b>=сто
<10\.2\.1\.\bых\b>=ста
<10\.2\.1\.\bрым\b>=ста
<10\.2\.1\.\bро\b>=сто
<10\.2\.1\.\bых\b>=сто
<10\.2\.1\.\bыми\b>=ста
<10\.2\.1\.\bах\b>=ста
<10\.2\.1\.\bа\b>=сто
<10\.2\.1\.\bго\b>=ста
<10\.2\.1\.\bе\b>=сотое
<10\.2\.1\.\bи\b>=сто
<10\.2\.1\.\bим\b>=ста
<10\.2\.1\.\bими\b>=ста
<10\.2\.1\.\bих\b>=ста
<10\.2\.1\.\bй\b>=сотой
<10\.2\.1\.\bый\b>=сотый
<10\.2\.1\.\bм\b>=сотом
<10\.2\.1\.\bми\b>=сотыми
<10\.2\.1\.\bму\b>=ста
<10\.2\.1\.\bо\b>=сто
<10\.2\.1\.\bого\b>=сотого
<10\.2\.1\.\bой\b>=ста
<10\.2\.1\.\bом\b>=ста
<10\.2\.1\.\bому\b>=сотому
<10\.2\.1\.\bою\b>=ста
<10\.2\.1\.\bу\b>=сто
<10\.2\.1\.\bх\b>=сотых
<10\.2\.1\.\bые\b>=сотые
<10\.2\.1\.\bым\b>=сотым
<10\.2\.1\.\bю\b>=сотую
<10\.2\.1\.\bя\b>=сотая
<10\.2\.2\.>=двести
<10\.2\.2\.\bро\b>=двести
<10\.2\.2\.\bых\b>=двухсот
<10\.2\.2\.\bрым\b>=двумстам
<10\.2\.2\.\bро\b>=двести
<10\.2\.2\.\bых\b>=двести
<10\.2\.2\.\bыми\b>=двумястами
<10\.2\.2\.\bах\b>=двухстах
<10\.2\.2\.\bа\b>=двести
<10\.2\.2\.\bго\b>=двухсот
<10\.2\.2\.\bе\b>=двухсотое
<10\.2\.2\.\bи\b>=двести
<10\.2\.2\.\bим\b>=двумястами
<10\.2\.2\.\bими\b>=двумястами
<10\.2\.2\.\bих\b>=двухсот
<10\.2\.2\.\bй\b>=двухсотой
<10\.2\.2\.\bый\b>=двухсотый
<10\.2\.2\.\bм\b>=двухсотом
<10\.2\.2\.\bми\b>=двухсотыми
<10\.2\.2\.\bму\b>=двумстам
<10\.2\.2\.\bо\b>=двести
<10\.2\.2\.\bого\b>=двухсотого
<10\.2\.2\.\bой\b>=двухсот
<10\.2\.2\.\bом\b>=двухстах
<10\.2\.2\.\bому\b>=двухсотому
<10\.2\.2\.\bою\b>=двумястами
<10\.2\.2\.\bу\b>=двести
<10\.2\.2\.\bх\b>=двухсотых
<10\.2\.2\.\bые\b>=двухсотые
<10\.2\.2\.\bым\b>=двухсотым
<10\.2\.2\.\bю\b>=двухсотую
<10\.2\.2\.\bя\b>=двухсотая
<10\.2\.3\.>=триста
<10\.2\.3\.\bро\b>=триста
<10\.2\.3\.\bых\b>=трехсот
<10\.2\.3\.\bрым\b>=трёмстам
<10\.2\.3\.\bро\b>=триста
<10\.2\.3\.\bых\b>=триста
<10\.2\.3\.\bыми\b>=тремястами
<10\.2\.3\.\bах\b>=трёхстах
<10\.2\.3\.\bа\b>=трехсот
<10\.2\.3\.\bго\b>=трехсот
<10\.2\.3\.\bе\b>=трёхсотое
<10\.2\.3\.\bи\b>=триста
<10\.2\.3\.\bим\b>=тремястами
<10\.2\.3\.\bими\b>=трёмстам
<10\.2\.3\.\bих\b>=трехсот
<10\.2\.3\.\bй\b>=трёхсотой
<10\.2\.3\.\bый\b>=трёхсотый
<10\.2\.3\.\bм\b>=трёхсотом
<10\.2\.3\.\bми\b>=трёхсотыми
<10\.2\.3\.\bму\b>=трёмстам
<10\.2\.3\.\bо\b>=трехсот
<10\.2\.3\.\bого\b>=трёхсотого
<10\.2\.3\.\bой\b>=трёмстам
<10\.2\.3\.\bом\b>=трёхстах
<10\.2\.3\.\bому\b>=трёхсотому
<10\.2\.3\.\bою\b>=тремястами
<10\.2\.3\.\bу\b>=триста
<10\.2\.3\.\bх\b>=трёхсотых
<10\.2\.3\.\bые\b>=трёхсотые
<10\.2\.3\.\bым\b>=трёхсотым
<10\.2\.3\.\bю\b>=трёхсотую
<10\.2\.3\.\bя\b>=трёхсотая
<10\.2\.4\.>=четыреста
<10\.2\.4\.\bро\b>=четыреста
<10\.2\.4\.\bых\b>=четырёхсот 
<10\.2\.4\.\bрым\b>=четырёмстам 
<10\.2\.4\.\bро\b>=четыреста
<10\.2\.4\.\bых\b>=четыреста
<10\.2\.4\.\bыми\b>=четырьмястами 
<10\.2\.4\.\bах\b>=четырёхстах
<10\.2\.4\.\bа\b>=четырёхсот 
<10\.2\.4\.\bго\b>=четырёхсот 
<10\.2\.4\.\bе\b>=четырёхсотое
<10\.2\.4\.\bи\b>=четыреста
<10\.2\.4\.\bим\b>=четырьмястами 
<10\.2\.4\.\bими\b>=четырёмстам 
<10\.2\.4\.\bих\b>=четырёхсот 
<10\.2\.4\.\bй\b>=четырёхсотой
<10\.2\.4\.\bый\b>=четырёхсотый
<10\.2\.4\.\bм\b>=четырёхсотом
<10\.2\.4\.\bми\b>=четырёхсотыми
<10\.2\.4\.\bму\b>=четырёмстам 
<10\.2\.4\.\bо\b>=четырёхсот 
<10\.2\.4\.\bого\b>=четырёхсотого
<10\.2\.4\.\bой\b>=четырёмстам 
<10\.2\.4\.\bом\b>=четырёхстах
<10\.2\.4\.\bому\b>=четырёхсотому
<10\.2\.4\.\bою\b>=четырьмястами
<10\.2\.4\.\bу\b>=четыреста 
<10\.2\.4\.\bх\b>=четырёхсотых
<10\.2\.4\.\bые\b>=четырёхсотые
<10\.2\.4\.\bым\b>=четырёхсотым
<10\.2\.4\.\bю\b>=четырёхсотую
<10\.2\.4\.\bя\b>=четырёхсотая
<10\.2\.5\.>=пятьсот
<10\.2\.5\.\bро\b>=пятьсот
<10\.2\.5\.\bых\b>=пятисот
<10\.2\.5\.\bрым\b>=пятистам
<10\.2\.5\.\bро\b>=пятьсот
<10\.2\.5\.\bых\b>=пятьсот
<10\.2\.5\.\bыми\b>=пятьюстами
<10\.2\.5\.\bах\b>=пятистах
<10\.2\.5\.\bа\b>=пятисот
<10\.2\.5\.\bго\b>=пятисот
<10\.2\.5\.\bе\b>=пятисотое
<10\.2\.5\.\bи\b>=пятьсот
<10\.2\.5\.\bим\b>=пятьюстами
<10\.2\.5\.\bими\b>=пятистам
<10\.2\.5\.\bих\b>=пятисот
<10\.2\.5\.\bй\b>=пятисотой
<10\.2\.5\.\bый\b>=пятисотый
<10\.2\.5\.\bм\b>=пятисотом
<10\.2\.5\.\bми\b>=пятисотыми
<10\.2\.5\.\bму\b>=пятистам
<10\.2\.5\.\bо\b>=пятисот
<10\.2\.5\.\bого\b>=пятисотого
<10\.2\.5\.\bой\b>=пятистам
<10\.2\.5\.\bом\b>=пятистах
<10\.2\.5\.\bому\b>=пятисотому
<10\.2\.5\.\bою\b>=пятьюстами
<10\.2\.5\.\bу\b>=пятьсот
<10\.2\.5\.\bх\b>=пятисотых
<10\.2\.5\.\bые\b>=пятисотые
<10\.2\.5\.\bым\b>=пятисотым
<10\.2\.5\.\bю\b>=пятисотую
<10\.2\.5\.\bя\b>=пятисотая
<10\.2\.6\.>=шестьсот
<10\.2\.6\.\bро\b>=шестьсот
<10\.2\.6\.\bых\b>=шестисот
<10\.2\.6\.\bрым\b>=шестистам
<10\.2\.6\.\bро\b>=шестьсот
<10\.2\.6\.\bых\b>=шестьсот
<10\.2\.6\.\bыми\b>=шестьюстами
<10\.2\.6\.\bах\b>=шестистах
<10\.2\.6\.\bа\b>=шестисот
<10\.2\.6\.\bго\b>=шестисот
<10\.2\.6\.\bе\b>=шестисотое
<10\.2\.6\.\bи\b>=шестьсот
<10\.2\.6\.\bим\b>=шестьюстами
<10\.2\.6\.\bими\b>=шестистам
<10\.2\.6\.\bих\b>=шестисот
<10\.2\.6\.\bй\b>=шестисотой
<10\.2\.6\.\bый\b>=шестисотый
<10\.2\.6\.\bм\b>=шестисотом
<10\.2\.6\.\bми\b>=шестисотыми
<10\.2\.6\.\bму\b>=шестистам
<10\.2\.6\.\bо\b>=шестисот
<10\.2\.6\.\bого\b>=шестисотого
<10\.2\.6\.\bой\b>=шестистам
<10\.2\.6\.\bом\b>=шестистах
<10\.2\.6\.\bому\b>=шестисотому
<10\.2\.6\.\bою\b>=шестьюстами
<10\.2\.6\.\bу\b>=шестьсот
<10\.2\.6\.\bх\b>=шестисотых
<10\.2\.6\.\bые\b>=шестисотые
<10\.2\.6\.\bым\b>=шестисотым
<10\.2\.6\.\bю\b>=шестисотую
<10\.2\.6\.\bя\b>=шестисотая
<10\.2\.7\.>=семьсот
<10\.2\.7\.\bро\b>=семьсот
<10\.2\.7\.\bых\b>=семисот
<10\.2\.7\.\bрым\b>=семистам
<10\.2\.7\.\bро\b>=семьсот
<10\.2\.7\.\bых\b>=семьсот
<10\.2\.7\.\bыми\b>=семьюстами
<10\.2\.7\.\bах\b>=семистах
<10\.2\.7\.\bа\b>=семисот
<10\.2\.7\.\bго\b>=семисот
<10\.2\.7\.\bе\b>=семисотое
<10\.2\.7\.\bи\b>=семьсот
<10\.2\.7\.\bим\b>=семьюстами
<10\.2\.7\.\bими\b>=семистам
<10\.2\.7\.\bих\b>=семисот
<10\.2\.7\.\bй\b>=семисотой
<10\.2\.7\.\bый\b>=семисотый
<10\.2\.7\.\bм\b>=семисотом
<10\.2\.7\.\bми\b>=семисотыми
<10\.2\.7\.\bму\b>=семистам
<10\.2\.7\.\bо\b>=семисот
<10\.2\.7\.\bого\b>=семисотого
<10\.2\.7\.\bой\b>=семистам
<10\.2\.7\.\bом\b>=семистах
<10\.2\.7\.\bому\b>=семисотому
<10\.2\.7\.\bою\b>=семьюстами
<10\.2\.7\.\bу\b>=семьсот
<10\.2\.7\.\bх\b>=семисотых
<10\.2\.7\.\bые\b>=семисотые
<10\.2\.7\.\bым\b>=семисотым
<10\.2\.7\.\bю\b>=семисотую
<10\.2\.7\.\bя\b>=семисотая
<10\.2\.8\.>=восемьсот
<10\.2\.8\.\bро\b>=восемьсот
<10\.2\.8\.\bых\b>=восьмисот
<10\.2\.8\.\bрым\b>=восьмистам
<10\.2\.8\.\bро\b>=восемьсот
<10\.2\.8\.\bых\b>=восемьсот
<10\.2\.8\.\bыми\b>=восьмьюстами
<10\.2\.8\.\bах\b>=восьмистах
<10\.2\.8\.\bа\b>=восьмисот
<10\.2\.8\.\bго\b>=восьмисот
<10\.2\.8\.\bе\b>=восьмисотое
<10\.2\.8\.\bи\b>=восемьсот
<10\.2\.8\.\bим\b>=восьмьюстами
<10\.2\.8\.\bими\b>=восьмистам
<10\.2\.8\.\bих\b>=восьмисот
<10\.2\.8\.\bй\b>=восьмисотой
<10\.2\.8\.\bый\b>=восьмисотый
<10\.2\.8\.\bм\b>=восьмисотом
<10\.2\.8\.\bми\b>=восьмисотыми
<10\.2\.8\.\bму\b>=восьмистам
<10\.2\.8\.\bо\b>=восьмисот
<10\.2\.8\.\bого\b>=восьмисотого
<10\.2\.8\.\bой\b>=восьмистам
<10\.2\.8\.\bом\b>=восьмистах
<10\.2\.8\.\bому\b>=восьмисотому
<10\.2\.8\.\bою\b>=восьмьюстами
<10\.2\.8\.\bу\b>=восемьсот
<10\.2\.8\.\bх\b>=восьмисотых
<10\.2\.8\.\bые\b>=восьмисотые
<10\.2\.8\.\bым\b>=восьмисотым
<10\.2\.8\.\bю\b>=восьмисотую
<10\.2\.8\.\bя\b>=восьмисотая
<10\.2\.9\.>=девятьсот
<10\.2\.9\.\bро\b>=девятьсот
<10\.2\.9\.\bых\b>=девятисот
<10\.2\.9\.\bрым\b>=девятистам
<10\.2\.9\.\bро\b>=девятьсот
<10\.2\.9\.\bых\b>=девятьсот
<10\.2\.9\.\bыми\b>=девятьюстами
<10\.2\.9\.\bах\b>=девятистах
<10\.2\.9\.\bа\b>=девятисот
<10\.2\.9\.\bго\b>=девятисот
<10\.2\.9\.\bе\b>=девятисотое
<10\.2\.9\.\bи\b>=девятьсот
<10\.2\.9\.\bим\b>=девятьюстами
<10\.2\.9\.\bими\b>=девятистам
<10\.2\.9\.\bих\b>=девятисот
<10\.2\.9\.\bй\b>=девятисотой
<10\.2\.9\.\bый\b>=девятисотый
<10\.2\.9\.\bм\b>=девятисотом
<10\.2\.9\.\bми\b>=девятисотыми
<10\.2\.9\.\bму\b>=девятистам
<10\.2\.9\.\bо\b>=девятисот
<10\.2\.9\.\bого\b>=девятисотого
<10\.2\.9\.\bой\b>=девятистам
<10\.2\.9\.\bом\b>=девятистах
<10\.2\.9\.\bому\b>=девятисотому
<10\.2\.9\.\bою\b>=девятьюстами
<10\.2\.9\.\bу\b>=девятьсот
<10\.2\.9\.\bх\b>=девятисотых
<10\.2\.9\.\bые\b>=девятисотые
<10\.2\.9\.\bым\b>=девятисотым
<10\.2\.9\.\bю\b>=девятисотую
<10\.2\.9\.\bя\b>=девятисотая
<10\.3\.1\.>=тысяч
<10\.3\.1\.\bро\b>=тысяча
<10\.3\.1\.\bых\b>=тысячи
<10\.3\.1\.\bрым\b>=тысячи
<10\.3\.1\.\bро\b>=тысяча
<10\.3\.1\.\bых\b>=тысяча
<10\.3\.1\.\bыми\b>=тысячами
<10\.3\.1\.\bах\b>=тысячах
<10\.3\.1\.\bа\b>=тысяча
<10\.3\.1\.\bго\b>=тысяч
<10\.3\.1\.\bе\b>=тысячное
<10\.3\.1\.\bи\b>=тысячах
<10\.3\.1\.\bим\b>=тысячу
<10\.3\.1\.\bими\b>=тысячами
<10\.3\.1\.\bих\b>=тысячах
<10\.3\.1\.\bй\b>=тысячной
<10\.3\.1\.\bый\b>=тысячный
<10\.3\.1\.\bм\b>=тысячном
<10\.3\.1\.\bми\b>=тысячными
<10\.3\.1\.\bму\b>=тысячам
<10\.3\.1\.\bо\b>=тысяч
<10\.3\.1\.\bого\b>=тысячного
<10\.3\.1\.\bой\b>=тысячи
<10\.3\.1\.\bом\b>=тысячей
<10\.3\.1\.\bому\b>=тысячному
<10\.3\.1\.\bою\b>=тысячей
<10\.3\.1\.\bу\b>=тысячу
<10\.3\.1\.\bх\b>=тысячных
<10\.3\.1\.\bые\b>=тысячные
<10\.3\.1\.\bым\b>=тысячным
<10\.3\.1\.\bю\b>=тысячную
<10\.3\.1\.\bя\b>=тысячная
<10\.3\.1\.\bах\b>=тысячах
#
<10\.0\.0\.>=ноль
<10\.0\.0\.\bро\b>=ноль
<10\.0\.0\.\bых\b>=ноля
<10\.0\.0\.\bрым\b>=нолю
<10\.0\.0\.\bро\b>=ноль
<10\.0\.0\.\bых\b>=ноль
<10\.0\.0\.\bыми\b>=нолём
<10\.0\.0\.\bах\b>=ноле
<10\.0\.0\.\bа\b>=ноль
<10\.0\.0\.\bго\b>=ноля
<10\.0\.0\.\bе\b>=нулевое
<10\.0\.0\.\bи\b>=ноль
<10\.0\.0\.\bим\b>=нолём
<10\.0\.0\.\bими\b>=нолями
<10\.0\.0\.\bих\b>=нолях
<10\.0\.0\.\bый\b>=нулевой
<10\.0\.0\.\bй\b>=нулевой
<10\.0\.0\.\bм\b>=нулевом
<10\.0\.0\.\bми\b>=нулевыми
<10\.0\.0\.\bму\b>=нолю
<10\.0\.0\.\bо\b>=ноль
<10\.0\.0\.\bого\b>=нулевого
<10\.0\.0\.\bой\b>=ноля
<10\.0\.0\.\bом\b>=ноле
<10\.0\.0\.\bому\b>=нулевому
<10\.0\.0\.\bою\b>=нолём
<10\.0\.0\.\bу\b>=ноль
<10\.0\.0\.\bх\b>=нулевых
<10\.0\.0\.\bые\b>=нулевые
<10\.0\.0\.\bым\b>=нулевым
<10\.0\.0\.\bю\b>=нулевую
<10\.0\.0\.\bя\b>=нулевая
#
<10\.0\.0\.([а-яё]{1,3})?>=
<10\.1\.0\.([а-яё]{1,3})?>=
<10\.2\.0\.([а-яё]{1,3})?>=
<10\.3\.0\.([а-яё]{1,3})?>=

# Удаление лишнего
<скл\.пор\.числ\.нач\.>=
<скл\.пор\.числ\.кон\.>=
<скл\.цел\.числ\.нач\.>=
<скл\.цел\.числ\.кон\.>=
<скл\.соб\.числ\.нач\.>=
<скл\.соб\.числ\.кон\.>=
###########################################################################################
# Цифровые окончания (конец)
###########################################################################################
#
\<\bрим\.\bч\.\>=
\s*(del_space)=
(\x20){2,}=$1
(\<)([A-Za-zА-Яа-яёЁ\d\-\.]+)(\>)=
# удаление лишнего
\s\-(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b|\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b|\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=
\bгг\.=
# Десятичные дроби 
#\b(\d+)(\.|\,)(0+)\b=$1
#\b(\d+)(\.|\,)(\d{8})\b=$1 и $3<:8:>
#\b(\d+)(\.|\,)(\d{7})\b=$1 и $3<:7:>
#\b(\d+)(\.|\,)(\d{6})\b=$1 и $3<:6:>
#\b(\d+)(\.|\,)(\d{5})\b=$1 и $3<:5:>
#\b(\d+)(\.|\,)(\d{4})\b=$1 и $3<:4:>
#\b(\d+)(\.|\,)(\d{3})\b=$1 и $3<:3:>
#\b(\d+)(\.|\,)(\d{2})\b=$1 и $3<:2:>
#\b(\d+)(\.|\,)(\d{1})\b=$1 и $3<:1:>
#<:1:>= десятых
#<:2:>= сотых
#<:3:>= тысячных
#<:4:>= десятитысячных
#<:5:>= стотысячных
#<:6:>= миллионных
#<:7:>= десятимиллионных
#<:8:>= стомиллионных
